#ifndef UE4SS_SDK_ABP_MainCharacter_PaintMan_HPP
#define UE4SS_SDK_ABP_MainCharacter_PaintMan_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_305;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_306;                                                         // 0x000C (size: 0x8)
    FName __NameProperty_307;                                                         // 0x0014 (size: 0x8)
    FName __NameProperty_308;                                                         // 0x001C (size: 0x8)
    FName __NameProperty_309;                                                         // 0x0024 (size: 0x8)
    FName __NameProperty_310;                                                         // 0x002C (size: 0x8)
    int32 __IntProperty_311;                                                          // 0x0034 (size: 0x4)
    FName __NameProperty_312;                                                         // 0x0038 (size: 0x8)
    int32 __IntProperty_313;                                                          // 0x0040 (size: 0x4)
    FName __NameProperty_314;                                                         // 0x0044 (size: 0x8)
    int32 __IntProperty_315;                                                          // 0x004C (size: 0x4)
    FName __NameProperty_316;                                                         // 0x0050 (size: 0x8)
    int32 __IntProperty_317;                                                          // 0x0058 (size: 0x4)
    bool __BoolProperty_318;                                                          // 0x005C (size: 0x1)
    float __FloatProperty_319;                                                        // 0x0060 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_320;                               // 0x0064 (size: 0x2C)
    float __FloatProperty_321;                                                        // 0x0090 (size: 0x4)
    EAnimSyncMethod __EnumProperty_322;                                               // 0x0094 (size: 0x1)
    bool __BoolProperty_323;                                                          // 0x0095 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_324;                             // 0x0096 (size: 0x1)
    FName __NameProperty_325;                                                         // 0x0098 (size: 0x8)
    FName __NameProperty_326;                                                         // 0x00A0 (size: 0x8)
    int32 __IntProperty_327;                                                          // 0x00A8 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_328;                                        // 0x00B0 (size: 0x20)
    FName __NameProperty_329;                                                         // 0x00D0 (size: 0x8)
    FName __NameProperty_330;                                                         // 0x00D8 (size: 0x8)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00E0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0160 (size: 0x40)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x01A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x01D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x0200 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt_2;               // 0x0230 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0260 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt_1;               // 0x0290 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x02C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x02F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_17;    // 0x0320 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x0350 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x0380 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x03B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x03E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x0410 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0440 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0470 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x04A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x04D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0500 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x0530 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x0560 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0590 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x05C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x05F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x0620 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x0650 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x0680 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x06B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x06E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0710 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0740 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x0770 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x07A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x07D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0800 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0830 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0860 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0890 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x08C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x08F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0920 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0950 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0980 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x09B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x09E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0A10 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0A40 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x0A70 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0AA0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0AD0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0B00 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0B30 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0B60 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0B90 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0BC0 (size: 0x30)

}; // Size: 0xBF0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

class UABP_MainCharacter_PaintMan_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03E0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03E8 (size: 0x14)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0400 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0408 (size: 0x8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0410 (size: 0xE8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x04F8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0540 (size: 0x80)
    FAnimNode_LookAt AnimGraphNode_LookAt_2;                                          // 0x05C0 (size: 0x250)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0810 (size: 0x48)
    FAnimNode_LookAt AnimGraphNode_LookAt_1;                                          // 0x0860 (size: 0x250)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0AB0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0AD0 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0AF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0B18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0B40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0BE0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0C08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x0C50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0C70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x0CB8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x0CD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0D20 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0D40 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x0D88 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x0E50 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0E78 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x0E98 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0EC0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x0EE0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x0FA8 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1028 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1050 (size: 0x28)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x1080 (size: 0x250)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x12D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x12F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1320 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x1348 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x1370 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x1398 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x13C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x13E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x1438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x1460 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1488 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x14D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x14F0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1538 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x1558 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x15C8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x15E8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1658 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1678 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x16C0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x16E0 (size: 0xC8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x17A8 (size: 0x20)
    bool __CustomProperty_Use IK_72D4D3584D2271B634D4ECA4D04F5614;                    // 0x17C8 (size: 0x1)
    class ABP_FirstPersonCharacter_Main_C* Character;                                 // 0x17D0 (size: 0x8)
    double Ground Speed;                                                              // 0x17D8 (size: 0x8)
    bool Should Move;                                                                 // 0x17E0 (size: 0x1)
    FVector Look At Location;                                                         // 0x17E8 (size: 0x18)
    bool IsDash;                                                                      // 0x1800 (size: 0x1)
    float HeadAlpha;                                                                  // 0x1804 (size: 0x4)
    double DefaultMaxSpeed;                                                           // 0x1808 (size: 0x8)
    double NormalizeSpeed;                                                            // 0x1810 (size: 0x8)
    FVector VectorSpeed;                                                              // 0x1818 (size: 0x18)
    FVector BeforeVector;                                                             // 0x1830 (size: 0x18)
    bool OnGround;                                                                    // 0x1848 (size: 0x1)
    bool IsControlled;                                                                // 0x1849 (size: 0x1)
    class UCharacterMoverComponent* MoverComponent;                                   // 0x1850 (size: 0x8)
    FVector RowSpeedVector;                                                           // 0x1858 (size: 0x18)
    bool NeckLock;                                                                    // 0x1870 (size: 0x1)
    bool IsCrouch;                                                                    // 0x1871 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_TransitionResult_CBC44EE44E91363E569AD5A75059FD7D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_LookAt_176F1E41460B77828E9160AE79CD2BD0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_LookAt_FE2AF8B94AF634BCE7F5B7B9C47DAB87();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_LookAt_A6F1400B4177B6CC733A57A245F6B442();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_TransitionResult_DF0DB5EA4D4EDCA13CF945B0B73635AB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_TransitionResult_CC2808E4433A1C3B59A9D59EB57E4B4F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_TransitionResult_646B95E14205B82D255FB2A391398207();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MainCharacter_PaintMan_AnimGraphNode_TransitionResult_8EE4E0B947FFA58BAD9AC48D8583C745();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintInitializeAnimation();
    void ExecuteUbergraph_ABP_MainCharacter_PaintMan(int32 EntryPoint);
}; // Size: 0x1872

#endif
