#ifndef UE4SS_SDK_ABP_LINK_Penguin_V2_HPP
#define UE4SS_SDK_ABP_LINK_Penguin_V2_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_320;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_321;                                                         // 0x000C (size: 0x8)
    FName __NameProperty_322;                                                         // 0x0014 (size: 0x8)
    FName __NameProperty_323;                                                         // 0x001C (size: 0x8)
    FName __NameProperty_324;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_325;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_326;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_327;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_328;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_329;                                                          // 0x0044 (size: 0x4)
    bool __BoolProperty_330;                                                          // 0x0048 (size: 0x1)
    FName __NameProperty_331;                                                         // 0x004C (size: 0x8)
    int32 __IntProperty_332;                                                          // 0x0054 (size: 0x4)
    float __FloatProperty_333;                                                        // 0x0058 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_334;                               // 0x005C (size: 0x2C)
    float __FloatProperty_335;                                                        // 0x0088 (size: 0x4)
    EAnimSyncMethod __EnumProperty_336;                                               // 0x008C (size: 0x1)
    bool __BoolProperty_337;                                                          // 0x008D (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_338;                             // 0x008E (size: 0x1)
    FName __NameProperty_339;                                                         // 0x0090 (size: 0x8)
    FName __NameProperty_340;                                                         // 0x0098 (size: 0x8)
    int32 __IntProperty_341;                                                          // 0x00A0 (size: 0x4)
    FName __NameProperty_342;                                                         // 0x00A4 (size: 0x8)
    FName __NameProperty_343;                                                         // 0x00AC (size: 0x8)
    int32 __IntProperty_344;                                                          // 0x00B4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_345;                                        // 0x00B8 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00D8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0158 (size: 0x40)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;  // 0x0198 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;  // 0x01C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt_1;               // 0x01F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_16;    // 0x0228 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_15;    // 0x0258 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_14;    // 0x0288 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_13;    // 0x02B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_12;    // 0x02E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0318 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x0348 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_6;       // 0x0378 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_9;          // 0x03A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x03D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_8;          // 0x0408 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0438 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_7;          // 0x0468 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_5;       // 0x0498 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x04C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x04F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_5;        // 0x0528 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x0558 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_3;                 // 0x0588 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x05B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;             // 0x05E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LookAt;                 // 0x0618 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0648 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0678 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x06A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x06D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x0708 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0738 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone_1;           // 0x0768 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;             // 0x0798 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x07C8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x07F8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0828 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0858 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0888 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x08B8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x08E8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x0918 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0948 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0978 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_4;       // 0x09A8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x09D8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0A08 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0A38 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0A68 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0A98 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x0AC8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x0AF8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0B28 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x0B58 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x0B88 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x0BB8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x0BE8 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0C18 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0C48 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0C78 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0CA8 (size: 0x30)

}; // Size: 0xCD8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

class UABP_LINK_Penguin_V2_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03E0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03E8 (size: 0x14)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0400 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0408 (size: 0x8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0410 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0430 (size: 0x20)
    FAnimNode_LookAt AnimGraphNode_LookAt_1;                                          // 0x0450 (size: 0x250)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x06A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x06C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x06F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0790 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x07B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x0800 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0820 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x0890 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x08B0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0920 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x0940 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0988 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x09A8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x0A70 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0A98 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0AB8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x0B00 (size: 0x28)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x0B28 (size: 0x4B8)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x0FE0 (size: 0x250)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1230 (size: 0xE8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1318 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x1360 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x13E0 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x1408 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1450 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x1498 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x15C0 (size: 0x128)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x16E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x1738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x1760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x1788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x17B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x17D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x1828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x1850 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1878 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x18C0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x18E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1928 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1948 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1990 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x19B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x19F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1A18 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x1A60 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1B28 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1B50 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1B70 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1B98 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1BB8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1C80 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1D00 (size: 0x28)
    bool __CustomProperty_Use IK_BCFB15F94A1A43167845238FB0435337;                    // 0x1D28 (size: 0x1)
    class ABP_FirstPersonCharacter_LINK_C* Character;                                 // 0x1D30 (size: 0x8)
    class UCharacterMovementComponent* Movement Component;                            // 0x1D38 (size: 0x8)
    double Ground Speed;                                                              // 0x1D40 (size: 0x8)
    bool Should Move;                                                                 // 0x1D48 (size: 0x1)
    FVector Look At Location;                                                         // 0x1D50 (size: 0x18)
    bool IsDash;                                                                      // 0x1D68 (size: 0x1)
    float HeadAlpha;                                                                  // 0x1D6C (size: 0x4)
    double DefaultMaxSpeed;                                                           // 0x1D70 (size: 0x8)
    double NormalizeSpeed;                                                            // 0x1D78 (size: 0x8)
    FVector VectorSpeed;                                                              // 0x1D80 (size: 0x18)
    FVector BeforeVector;                                                             // 0x1D98 (size: 0x18)
    FTransform HandTransform_R;                                                       // 0x1DB0 (size: 0x60)
    FTransform HandTransform_L;                                                       // 0x1E10 (size: 0x60)
    double HandWeight_R;                                                              // 0x1E70 (size: 0x8)
    double HandWeight_L;                                                              // 0x1E78 (size: 0x8)
    bool OnGround;                                                                    // 0x1E80 (size: 0x1)
    bool IsControlled;                                                                // 0x1E81 (size: 0x1)
    bool Is Freeze;                                                                   // 0x1E82 (size: 0x1)
    double Voice;                                                                     // 0x1E88 (size: 0x8)
    class UCharacterMoverComponent* MoverComponent;                                   // 0x1E90 (size: 0x8)
    FVector RowSpeedVector;                                                           // 0x1E98 (size: 0x18)
    bool IsClimbing;                                                                  // 0x1EB0 (size: 0x1)
    bool NeckLock;                                                                    // 0x1EB1 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LINK_Penguin_V2_AnimGraphNode_LookAt_B097C67F4524F41CE62DB7B98FDF98FB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LINK_Penguin_V2_AnimGraphNode_ControlRig_BCFB15F94A1A43167845238FB0435337();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LINK_Penguin_V2_AnimGraphNode_LookAt_EEAB3B4443037712C54AA598729B082D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LINK_Penguin_V2_AnimGraphNode_TransitionResult_F4E985C14164C1C0D1D5BE9BF725BAAC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LINK_Penguin_V2_AnimGraphNode_TransitionResult_D09CF7F745E1359D3516DFA5AAEC05A8();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintInitializeAnimation();
    void ExecuteUbergraph_ABP_LINK_Penguin_V2(int32 EntryPoint);
}; // Size: 0x1EB2

#endif
