#ifndef UE4SS_SDK_ABP_MiniPenguin_HPP
#define UE4SS_SDK_ABP_MiniPenguin_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_213;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_214;                                                         // 0x000C (size: 0x8)
    FName __NameProperty_215;                                                         // 0x0014 (size: 0x8)
    FName __NameProperty_216;                                                         // 0x001C (size: 0x8)
    FName __NameProperty_217;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_218;                                                          // 0x002C (size: 0x4)
    bool __BoolProperty_219;                                                          // 0x0030 (size: 0x1)
    FName __NameProperty_220;                                                         // 0x0034 (size: 0x8)
    int32 __IntProperty_221;                                                          // 0x003C (size: 0x4)
    float __FloatProperty_222;                                                        // 0x0040 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_223;                               // 0x0044 (size: 0x2C)
    float __FloatProperty_224;                                                        // 0x0070 (size: 0x4)
    EAnimSyncMethod __EnumProperty_225;                                               // 0x0074 (size: 0x1)
    bool __BoolProperty_226;                                                          // 0x0075 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_227;                             // 0x0076 (size: 0x1)
    FName __NameProperty_228;                                                         // 0x0078 (size: 0x8)
    FName __NameProperty_229;                                                         // 0x0080 (size: 0x8)
    int32 __IntProperty_230;                                                          // 0x0088 (size: 0x4)
    FName __NameProperty_231;                                                         // 0x008C (size: 0x8)
    FName __NameProperty_232;                                                         // 0x0094 (size: 0x8)
    int32 __IntProperty_233;                                                          // 0x009C (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_234;                                        // 0x00A0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x00C0 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0140 (size: 0x40)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_11;    // 0x0180 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_10;    // 0x01B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_9;     // 0x01E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_8;     // 0x0210 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_7;     // 0x0240 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_6;     // 0x0270 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer_1;     // 0x02A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_6;          // 0x02D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;       // 0x0300 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_5;          // 0x0330 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_3;       // 0x0360 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_4;          // 0x0390 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine_1;         // 0x03C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                   // 0x03F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ControlRig;             // 0x0420 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;       // 0x0450 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_2;                 // 0x0480 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;       // 0x04B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                 // 0x04E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                   // 0x0510 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_5;     // 0x0540 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_4;     // 0x0570 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_3;     // 0x05A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_2;     // 0x05D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult_1;     // 0x0600 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;       // 0x0630 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_2;       // 0x0660 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_3;          // 0x0690 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;       // 0x06C0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_2;          // 0x06F0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;         // 0x0720 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ApplyAdditive;          // 0x0750 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_4;        // 0x0780 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;          // 0x07B0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_3;        // 0x07E0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;            // 0x0810 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;           // 0x0840 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;         // 0x0870 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;        // 0x08A0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;        // 0x08D0 (size: 0x30)
    FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;          // 0x0900 (size: 0x30)

}; // Size: 0x930

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)

}; // Size: 0x14

class UABP_MiniPenguin_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03E0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x03E8 (size: 0x14)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0400 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0408 (size: 0x8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0410 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0438 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0460 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0488 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x04B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x04D8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x0500 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0570 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0590 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x0600 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x0620 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x0668 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x0688 (size: 0xC8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0750 (size: 0x20)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x0770 (size: 0x4B8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0C28 (size: 0xE8)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0D10 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x0D58 (size: 0x80)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0DD8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x0E20 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0E68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0E90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0EB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x0EE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x0F08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0F30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x0F58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x0FA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x0FC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1008 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1028 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x1070 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x1138 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1160 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x1180 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x11A8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x11C8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1290 (size: 0x80)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1310 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1338 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1360 (size: 0x28)
    bool __CustomProperty_Use IK_8D52FC8F421A827201CB7AADA6C13C83;                    // 0x1388 (size: 0x1)
    double Ground Speed;                                                              // 0x1390 (size: 0x8)
    bool Should Move;                                                                 // 0x1398 (size: 0x1)
    FVector Look At Location;                                                         // 0x13A0 (size: 0x18)
    bool IsDash;                                                                      // 0x13B8 (size: 0x1)
    double DefaultMaxSpeed;                                                           // 0x13C0 (size: 0x8)
    double NormalizeSpeed;                                                            // 0x13C8 (size: 0x8)
    FVector VectorSpeed;                                                              // 0x13D0 (size: 0x18)
    FVector BeforeVector;                                                             // 0x13E8 (size: 0x18)
    bool OnGround;                                                                    // 0x1400 (size: 0x1)
    double Voice;                                                                     // 0x1408 (size: 0x8)
    class UCharacterMoverComponent* MoverComponent;                                   // 0x1410 (size: 0x8)
    FVector RowSpeedVector;                                                           // 0x1418 (size: 0x18)
    class UCommonLegacyMovementSettings* MovementSettings;                            // 0x1430 (size: 0x8)
    double ControlRigAlpha;                                                           // 0x1438 (size: 0x8)
    class UBPC_ReplicateAnimBPState_C* ReplicateAnimBPState;                          // 0x1440 (size: 0x8)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MiniPenguin_AnimGraphNode_TransitionResult_4E49FAE24595B658CDCDB9AA6E945C84();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintInitializeAnimation();
    void ExecuteUbergraph_ABP_MiniPenguin(int32 EntryPoint);
}; // Size: 0x1448

#endif
