#ifndef UE4SS_SDK_ST_GenerateBoxLocation_HPP
#define UE4SS_SDK_ST_GenerateBoxLocation_HPP

struct FST_GenerateBoxLocation
{
    int32 SpawnNum_6_A41724AA48086D0D82267F8CDDA3009C;                                // 0x0000 (size: 0x4)
    TSubclassOf<class AActor> GenerateClass_3_DF97AD3648731A9BCBCE4582A8222FF8;       // 0x0008 (size: 0x8)
    FVector TraceBoundSize_9_556DF56F490DEC169773E48E94263F56;                        // 0x0010 (size: 0x18)
    double FloorCheckDistance_12_437B63734E2CEF02465044A710265890;                    // 0x0028 (size: 0x8)
    int32 MaxGenerateCharange_19_EB8E74654A24CCFE530B729A9CEBBA97;                    // 0x0030 (size: 0x4)
    bool IsInfinity_18_BFCE1D3D404853C6CC37288964E0F82C;                              // 0x0034 (size: 0x1)
    FVector2D RnadomScaleRange_23_532D9EA24C9B4985CA2202A1269B2E1B;                   // 0x0038 (size: 0x10)
    bool IgnoreNoGrow_25_E49E58BB461E70EA0D2740BF2BF81026;                            // 0x0048 (size: 0x1)

}; // Size: 0x49

#endif
