#ifndef UE4SS_SDK_Transient_HPP
#define UE4SS_SDK_Transient_HPP

struct FChaosDestructionEvent_SWC
{
    FVector3f position;                                                               // 0x0000 (size: 0xC)
    FVector3f Normal;                                                                 // 0x000C (size: 0xC)
    FVector3f Velocity;                                                               // 0x0018 (size: 0xC)
    FVector3f AngularVelocity;                                                        // 0x0024 (size: 0xC)
    float ExtentMin;                                                                  // 0x0030 (size: 0x4)
    float ExtentMax;                                                                  // 0x0034 (size: 0x4)
    int32 ParticleID;                                                                 // 0x0038 (size: 0x4)
    float Time;                                                                       // 0x003C (size: 0x4)
    int32 Type;                                                                       // 0x0040 (size: 0x4)

}; // Size: 0x44

struct FPropertyBag_2df2c3ec61a655a3
{
    FTransform RigVMModel___RigUnit_GetTransform_1_Transform;                         // 0x0000 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_1_CachedIndex;        // 0x0060 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_CachedIndex;          // 0x0070 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_Transform;                           // 0x0080 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_CachedIndex;          // 0x00E0 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___RigUnit_SetTransform_1_CachedIndex;        // 0x00F0 (size: 0x10)
    FVector RigVMModel___FootTrace_Hit_Location;                                      // 0x0100 (size: 0x18)
    FVector FootTrace___FootTrace_MathVectorAdd_Result;                               // 0x0118 (size: 0x18)
    FTransform FootTrace___FootTrace_GetTransform_Transform;                          // 0x0130 (size: 0x60)
    TArray<FCachedRigElement> FootTrace___FootTrace_GetTransform_CachedIndex;         // 0x0190 (size: 0x10)
    FVector FootTrace___FootTrace_MathVectorAdd_A__IO;                                // 0x01A0 (size: 0x18)
    float FootTrace___FootTrace_MathFloatAdd_Result;                                  // 0x01B8 (size: 0x4)
    float FootTrace___FootTrace_MathFloatAdd_A;                                       // 0x01BC (size: 0x4)
    FTransform FootTrace___FootTrace_GetTransform_1_Transform;                        // 0x01C0 (size: 0x60)
    TArray<FCachedRigElement> FootTrace___FootTrace_GetTransform_1_CachedIndex;       // 0x0220 (size: 0x10)
    FVector FootTrace___FootTrace_MathVectorSub_Result;                               // 0x0230 (size: 0x18)
    FVector FootTrace___FootTrace_MathVectorSub_A__IO;                                // 0x0248 (size: 0x18)
    bool FootTrace___FootTrace_SphereTraceByTraceChannel_1_bHit;                      // 0x0260 (size: 0x1)
    FVector FootTrace___FootTrace_SphereTraceByTraceChannel_1_HitNormal;              // 0x0268 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> FootTrace___FootTrace_SphereTraceByTraceChannel_1_WorkData; // 0x0280 (size: 0x10)
    FVector RigVMModel___FootTrace_1_Hit_Location;                                    // 0x0290 (size: 0x18)
    FVector FootTrace_1___FootTrace_MathVectorAdd_Result;                             // 0x02A8 (size: 0x18)
    FTransform FootTrace_1___FootTrace_GetTransform_Transform;                        // 0x02C0 (size: 0x60)
    TArray<FCachedRigElement> FootTrace_1___FootTrace_GetTransform_CachedIndex;       // 0x0320 (size: 0x10)
    FVector FootTrace_1___FootTrace_MathVectorAdd_A__IO;                              // 0x0330 (size: 0x18)
    float FootTrace_1___FootTrace_MathFloatAdd_Result;                                // 0x0348 (size: 0x4)
    float FootTrace_1___FootTrace_MathFloatAdd_A;                                     // 0x034C (size: 0x4)
    FTransform FootTrace_1___FootTrace_GetTransform_1_Transform;                      // 0x0350 (size: 0x60)
    TArray<FCachedRigElement> FootTrace_1___FootTrace_GetTransform_1_CachedIndex;     // 0x03B0 (size: 0x10)
    FVector FootTrace_1___FootTrace_MathVectorSub_Result;                             // 0x03C0 (size: 0x18)
    FVector FootTrace_1___FootTrace_MathVectorSub_A__IO;                              // 0x03D8 (size: 0x18)
    bool FootTrace_1___FootTrace_SphereTraceByTraceChannel_1_bHit;                    // 0x03F0 (size: 0x1)
    FVector FootTrace_1___FootTrace_SphereTraceByTraceChannel_1_HitNormal;            // 0x03F8 (size: 0x18)
    TArray<FRigUnit_SphereTrace_WorkData> FootTrace_1___FootTrace_SphereTraceByTraceChannel_1_WorkData; // 0x0410 (size: 0x10)
    FName RigVMModel___Branch_RigVMUnitNode_BlockToRun;                               // 0x0420 (size: 0x8)
    float RigVMModel___AlphaInterp_Result;                                            // 0x0428 (size: 0x4)
    float RigVMModel___AlphaInterp_Value;                                             // 0x042C (size: 0x4)
    TArray<FInputScaleBiasClamp> RigVMModel___AlphaInterp_ScaleBiasClamp;             // 0x0430 (size: 0x10)
    float RigVMModel___AlphaInterp_1_Result;                                          // 0x0440 (size: 0x4)
    float RigVMModel___AlphaInterp_1_Value;                                           // 0x0444 (size: 0x4)
    TArray<FInputScaleBiasClamp> RigVMModel___AlphaInterp_1_ScaleBiasClamp;           // 0x0448 (size: 0x10)
    double RigVMModel___If_DISPATCH_RigVMDispatch_If_Result;                          // 0x0458 (size: 0x8)
    bool RigVMModel___MathFloatLess_Result;                                           // 0x0460 (size: 0x1)
    float RigVMModel___MathFloatLess_A;                                               // 0x0464 (size: 0x4)
    float RigVMModel___MathFloatLess_B;                                               // 0x0468 (size: 0x4)
    bool RigVMModel___If_DISPATCH_RigVMDispatch_If_Condition;                         // 0x046C (size: 0x1)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__IO; // 0x0470 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_WorkData; // 0x0480 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__IO; // 0x0490 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_WorkData; // 0x04A0 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__IO; // 0x04B0 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_WorkData> RigVMModel___ModifyTransforms_1_1_WorkData; // 0x04C0 (size: 0x10)
    TArray<FPBIKEffector> RigVMModel___PBIK_Effectors__IO;                            // 0x04D0 (size: 0x10)
    FTransform RigVMModel___GetTransform_Transform;                                   // 0x04E0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_CachedIndex;                  // 0x0540 (size: 0x10)
    FTransform RigVMModel___GetTransform_1_Transform;                                 // 0x0550 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___GetTransform_1_CachedIndex;                // 0x05B0 (size: 0x10)
    TArray<TArray<int32>> RigVMModel___PBIK_EffectorSolverIndices;                    // 0x05C0 (size: 0x10)
    TArray<FPBIKWorkData> RigVMModel___PBIK_WorkData;                                 // 0x05D0 (size: 0x10)

}; // Size: 0x5E0

struct FPropertyBag_3140788adf6bfb8
{
    FRigElementKey RigVMModel___RigUnit_SetTransform_Item__Const;                     // 0x0000 (size: 0xC)
    ERigVMTransformSpace RigVMModel___RigUnit_SetTransform_Space__Const;              // 0x000C (size: 0x1)
    bool RigVMModel___RigUnit_SetTransform_bInitial__Const;                           // 0x000D (size: 0x1)
    FRigElementKey RigVMModel___RigUnit_GetTransform_1_Item__Const;                   // 0x0010 (size: 0xC)
    float RigVMModel___RigUnit_SetTransform_Weight__Const;                            // 0x001C (size: 0x4)
    bool RigVMModel___RigUnit_SetTransform_bPropagateToChildren__Const;               // 0x0020 (size: 0x1)
    FRigElementKey RigVMModel___RigUnit_SetTransform_1_Item__Const;                   // 0x0024 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_Item__Const;                     // 0x0030 (size: 0xC)
    bool FootTrace___FootTrace_GetTransform_bInitial__Const;                          // 0x003C (size: 0x1)
    float FootTrace___FootTrace_MathFloatAdd_B__Const;                                // 0x0040 (size: 0x4)
    FRigElementKey FootTrace___FootTrace_GetTransform_1_Item__Const;                  // 0x0044 (size: 0xC)
    FVector FootTrace___FootTrace_MathVectorAdd_B__Const;                             // 0x0050 (size: 0x18)
    FVector FootTrace___FootTrace_MathVectorSub_B__Const;                             // 0x0068 (size: 0x18)
    ETraceTypeQuery FootTrace___FootTrace_SphereTraceByTraceChannel_1_TraceChannel__Const; // 0x0080 (size: 0x1)
    double RigVMModel___VariableNode_1_Value__Const;                                  // 0x0088 (size: 0x8)
    float RigVMModel___AlphaInterp_Bias__Const;                                       // 0x0090 (size: 0x4)
    FInputRange RigVMModel___AlphaInterp_InRange__Const;                              // 0x0094 (size: 0x8)
    float RigVMModel___AlphaInterp_InterpSpeedIncreasing__Const;                      // 0x009C (size: 0x4)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_ItemToModify__Const; // 0x00A0 (size: 0x10)
    EControlRigModifyBoneMode RigVMModel___ModifyTransforms_Mode__Const;              // 0x00B0 (size: 0x1)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_ItemToModify__Const; // 0x00B8 (size: 0x10)
    TArray<FRigUnit_ModifyTransforms_PerItem> RigVMModel___ModifyTransforms_1_1_ItemToModify__Const; // 0x00C8 (size: 0x10)
    FName RigVMModel___PBIK_Root__Const;                                              // 0x00D8 (size: 0x8)
    TArray<FPBIKEffector> RigVMModel___PBIK_Effectors__Const;                         // 0x00E0 (size: 0x10)
    TArray<FPBIKBoneSetting> RigVMModel___PBIK_BoneSettings__Const;                   // 0x00F0 (size: 0x10)
    TArray<FName> RigVMModel___PBIK_ExcludedBones__Const;                             // 0x0100 (size: 0x10)
    FPBIKSolverSettings RigVMModel___PBIK_Settings__Const;                            // 0x0110 (size: 0x40)
    FPBIKDebug RigVMModel___PBIK_Debug__Const;                                        // 0x0150 (size: 0x8)

}; // Size: 0x158

#endif
