#ifndef UE4SS_SDK_UDS_Post_Process_Stage_HPP
#define UE4SS_SDK_UDS_Post_Process_Stage_HPP

struct FUDS_Post_Process_Stage
{
    FString Label_24_760DA3B649F655929138B7846A0B840F;                                // 0x0000 (size: 0x10)
    FPostProcessSettings PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686;     // 0x0010 (size: 0x760)
    double Priority_47_5B0BDA844B69DB2E7768168865CD16E0;                              // 0x0770 (size: 0x8)
    bool DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534;                        // 0x0778 (size: 0x1)
    bool DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4;                       // 0x0779 (size: 0x1)
    bool DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F;                          // 0x077A (size: 0x1)
    bool DisableifOvercast_52_989272994F5025F12C728292C335B969;                       // 0x077B (size: 0x1)
    bool DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515;                    // 0x077C (size: 0x1)
    bool DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10;                          // 0x077D (size: 0x1)
    bool DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907;                       // 0x077E (size: 0x1)
    bool DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F;                          // 0x077F (size: 0x1)
    bool DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02;                       // 0x0780 (size: 0x1)
    bool DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83;                 // 0x0781 (size: 0x1)
    bool DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E;                // 0x0782 (size: 0x1)
    bool DisableifRaining_66_6BC8BF074301B1FEAD90188DAE684C20;                        // 0x0783 (size: 0x1)
    bool DisableifNotRaining_68_AE74EF0B44F68955FD9AA38EB1A1ECC4;                     // 0x0784 (size: 0x1)
    bool DisableifSnowing_70_63462F7A45D418DF0033E496E5F1C2A3;                        // 0x0785 (size: 0x1)
    bool DisableifNotSnowing_72_5FBF6A2940E5085175DF21A4FB1E2444;                     // 0x0786 (size: 0x1)

}; // Size: 0x787

#endif
