#ifndef UE4SS_SDK_UDS_Space_Planet_HPP
#define UE4SS_SDK_UDS_Space_Planet_HPP

struct FUDS_Space_Planet
{
    TEnumAsByte<UDS_Space_Parent::Type> Parent_2_0E1A37CE4AF01519A9BCE6ACA2CD1137;    // 0x0000 (size: 0x1)
    FRotator RelativeRotation_5_6AB46E784AAA14769695A882EB23223E;                     // 0x0008 (size: 0x18)
    double Scale_9_D8C257DF48AA1AA6FF92B0BADA269EDB;                                  // 0x0020 (size: 0x8)
    TSoftObjectPtr<UTexture2D> ColorTexture_30_2BBB70D24D2BDD9AD355609B4FF9B21B;      // 0x0028 (size: 0x28)
    FLinearColor ColorTextureTint_123_F088C5B64DFD1D20EEC23CBC27966B9C;               // 0x0050 (size: 0x10)
    TSoftObjectPtr<UTexture2D> NormalMap_33_A9266AE648B84654F7C9B9849CFA3E7C;         // 0x0060 (size: 0x28)
    double NormalMapStrength_36_6F822CA84FCDEF589CED9595F668D77A;                     // 0x0088 (size: 0x8)
    FLinearColor DarkSideTint_40_83860D2D4EEEF7086AB3AFB09CF1DCCC;                    // 0x0090 (size: 0x10)
    FLinearColor LightSideTint_42_0EF08CD645E27CABBE7DBD8E7471F04B;                   // 0x00A0 (size: 0x10)
    double TerminatorThickness_58_E6DC59F2417BA23BB1BAA5BF464BF621;                   // 0x00B0 (size: 0x8)
    double TerminatorPower_60_249814CB4B2F0A60E458FEA89132D36E;                       // 0x00B8 (size: 0x8)
    double TerminatorOffset_62_E26446874807C179E62DC3A3D511938F;                      // 0x00C0 (size: 0x8)
    FLinearColor TerminatorTint_44_8A6F729743E618D4CBE093BDCA99CD01;                  // 0x00C8 (size: 0x10)
    TEnumAsByte<UDS_Planet_Lightsource::Type> LightVector_105_71AFA5654C1A2915EF2F6F9636985F79; // 0x00D8 (size: 0x1)
    FVector CustomLightVector_108_A1E02E374DF47067FFF4BB83AD035BC4;                   // 0x00E0 (size: 0x18)
    double Glow_116_6BBE205A4CB7B5A1555103A09A90E0F7;                                 // 0x00F8 (size: 0x8)
    FLinearColor GlowColor_117_D644808A49C9F262468CD988D1087F09;                      // 0x0100 (size: 0x10)
    double GlowScale_120_20ADA5B346CD968A0904D284F1D968B0;                            // 0x0110 (size: 0x8)
    bool RenderAtmosphere_47_8FA38C394C66F95149E4269D6A13E9DE;                        // 0x0118 (size: 0x1)
    double AtmosphereStrength_50_0D33B16248764FF3CEBC98B70F026998;                    // 0x0120 (size: 0x8)
    double AtmosphereThickness_52_0C2D526D4C6E998A929F2D9A2B3FE30B;                   // 0x0128 (size: 0x8)
    FLinearColor AtmosphereColor_55_39F94C30482BE08919CDB1BE025A7DC8;                 // 0x0130 (size: 0x10)
    TSoftObjectPtr<UTexture2D> EmissiveTexture_66_5312AAA94E7A901D5F46D6AC848F943F;   // 0x0140 (size: 0x28)
    FLinearColor EmissiveLightSideTint_73_969799654B9C1754BDE425B229EA063E;           // 0x0168 (size: 0x10)
    FLinearColor EmissiveDarkSideTint_74_EBFDD1104CC20ADAE943EC913D1977B2;            // 0x0178 (size: 0x10)
    bool RenderRing_78_1DDEF5604EC914832AB31CA1327D2947;                              // 0x0188 (size: 0x1)
    double RingPitch_80_56F5E8E14589B8624F3C7B9951D4C8D1;                             // 0x0190 (size: 0x8)
    double RingRoll_82_091721764596A286D8F56C92EFB17435;                              // 0x0198 (size: 0x8)
    double RingDistance_84_8E87B9394476970597D7A8B81A055C39;                          // 0x01A0 (size: 0x8)
    double RingWidth_86_324627CE43F44BEFA03D019FC1E0FF8F;                             // 0x01A8 (size: 0x8)
    TSoftObjectPtr<UTexture2D> RingTexture_92_B962AC934EE0E4617A29BE9F710F32EF;       // 0x01B0 (size: 0x28)
    FLinearColor RingTintColor_95_4F6B04E54C74C020B0C009971EB24538;                   // 0x01D8 (size: 0x10)
    double RingOpacity_98_6F398376468F51CF8289D9AA39638D49;                           // 0x01E8 (size: 0x8)
    double RingShadowBrightness_100_82A5108141E68184387C0CBDA39F37D6;                 // 0x01F0 (size: 0x8)
    double RingShadowSoftness_102_B53027E540B8F2E6C7744D90958C1B85;                   // 0x01F8 (size: 0x8)
    bool RingAroundLocalPlanet_137_C88F416041C533DC98C9EA8F7D68CBD7;                  // 0x0200 (size: 0x1)
    TSoftObjectPtr<UTexture2D> MeshDeformTexture_126_B7DC215A433430E4AD89459B331BC0CE; // 0x0208 (size: 0x28)
    double MeshDeformStrength_129_CBDEB487415F39784E41DBB95BE8F4B1;                   // 0x0230 (size: 0x8)
    double MeshDeformCenterLevel_135_D94322934BFA5C635C0D2BA54E37A086;                // 0x0238 (size: 0x8)
    FVector MeshDeformTextureOffset_132_F11E46C5458E2C4E5B3ABB8E3C2E6B45;             // 0x0240 (size: 0x18)

}; // Size: 0x258

#endif
