#ifndef UE4SS_SDK_UDW_WeatherState_Structure_HPP
#define UE4SS_SDK_UDW_WeatherState_Structure_HPP

struct FUDW_WeatherState_Structure
{
    double CloudCoverage_27_31BA899D45A8A1B84FBCC7AEA870954F;                         // 0x0000 (size: 0x8)
    double Rain_4_4019C4FF4CE970F8CF06F99779966140;                                   // 0x0008 (size: 0x8)
    double Snow_6_4DF1B106404D7B2DA02FBBB54BEB004A;                                   // 0x0010 (size: 0x8)
    double ThunderLightning_8_6C3109794B58BE8BE4D0D39E9247D947;                       // 0x0018 (size: 0x8)
    double WindIntensity_28_7D0941E340035FB4BC9CD196CE7AA58B;                         // 0x0020 (size: 0x8)
    double Fog_22_4B6E454642665C025DADA1BD443B667A;                                   // 0x0028 (size: 0x8)
    double Dust_23_4639102D44077B805735A6BC027AF7ED;                                  // 0x0030 (size: 0x8)
    double MaterialWetness_29_2CE413784192D57B1FA486B8BF605372;                       // 0x0038 (size: 0x8)
    double MaterialSnowCoverage_30_10F93D3F42158AD6D1D5B7A58EB30E28;                  // 0x0040 (size: 0x8)
    double MaterialDustCoverage_31_4C9DA3A1430CCB4B92BCAB95AB03CAA9;                  // 0x0048 (size: 0x8)

}; // Size: 0x50

#endif
