#ifndef UE4SS_SDK_Ultra_Dynamic_Sky_HPP
#define UE4SS_SDK_Ultra_Dynamic_Sky_HPP

class AUltra_Dynamic_Sky_C : public AActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* Moon Handle;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* Sun Handle;                                           // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* S;                                                    // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* E;                                                    // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* N;                                                    // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* W;                                                    // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* Compass;                                              // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* UDS Label;                                            // 0x02E8 (size: 0x8)
    class USkyLightComponent* Captured Scene Sky Light;                               // 0x02F0 (size: 0x8)
    class UVolumetricCloudComponent* VolumetricCloud;                                 // 0x02F8 (size: 0x8)
    class UPostProcessComponent* PostProcess;                                         // 0x0300 (size: 0x8)
    class USkyLightComponent* Cubemap Sky Light;                                      // 0x0308 (size: 0x8)
    class UStaticMeshComponent* Sky_Sphere;                                           // 0x0310 (size: 0x8)
    class USkyAtmosphereComponent* SkyAtmosphere;                                     // 0x0318 (size: 0x8)
    class UDirectionalLightComponent* Sun;                                            // 0x0320 (size: 0x8)
    class UDirectionalLightComponent* Moon;                                           // 0x0328 (size: 0x8)
    class UExponentialHeightFogComponent* HeightFog;                                  // 0x0330 (size: 0x8)
    class UStaticMeshComponent* ClockDisk;                                            // 0x0338 (size: 0x8)
    class USceneComponent* SkyRoot;                                                   // 0x0340 (size: 0x8)
    class UMaterialInstanceDynamic* Sky Sphere MID;                                   // 0x0348 (size: 0x8)
    double Cloud Speed;                                                               // 0x0350 (size: 0x8)
    double Cloud Wisps Opacity (Clear);                                               // 0x0358 (size: 0x8)
    bool Refresh Settings;                                                            // 0x0360 (size: 0x1)
    double Time of Day;                                                               // 0x0368 (size: 0x8)
    TEnumAsByte<UDS_SkyMode::Type> Sky Mode;                                          // 0x0370 (size: 0x1)
    TEnumAsByte<UDS_ColorMode::Type> Color Mode;                                      // 0x0371 (size: 0x1)
    TEnumAsByte<UDS_Project_Mode::Type> Project Mode;                                 // 0x0372 (size: 0x1)
    TEnumAsByte<UDS_RenderingFeatureLevel::Type> Feature Level;                       // 0x0373 (size: 0x1)
    double Cloud Coverage;                                                            // 0x0378 (size: 0x8)
    double Fog;                                                                       // 0x0380 (size: 0x8)
    double Overall Intensity;                                                         // 0x0388 (size: 0x8)
    double Cloud Direction;                                                           // 0x0390 (size: 0x8)
    double Cloud Phase;                                                               // 0x0398 (size: 0x8)
    bool Manually Position Moon Target;                                               // 0x03A0 (size: 0x1)
    bool Render Moon;                                                                 // 0x03A1 (size: 0x1)
    double Moon Light Intensity;                                                      // 0x03A8 (size: 0x8)
    TEnumAsByte<EComponentMobility::Type> Moon Mobility;                              // 0x03B0 (size: 0x1)
    double Moon Scale;                                                                // 0x03B8 (size: 0x8)
    double Moon Phase;                                                                // 0x03C0 (size: 0x8)
    double Moon Yaw;                                                                  // 0x03C8 (size: 0x8)
    double Moon Pitch;                                                                // 0x03D0 (size: 0x8)
    double Moon Vertical Offset;                                                      // 0x03D8 (size: 0x8)
    double Moon Orbit Offset;                                                         // 0x03E0 (size: 0x8)
    bool Moon Casts Shadows;                                                          // 0x03E8 (size: 0x1)
    bool Moon Transmission;                                                           // 0x03E9 (size: 0x1)
    FLinearColor Moon Light Color;                                                    // 0x03EC (size: 0x10)
    TSoftObjectPtr<UTexture2D> Moon Texture;                                          // 0x0400 (size: 0x28)
    FLinearColor Moon Material Color;                                                 // 0x0428 (size: 0x10)
    double Moon Texture Intensity (Night);                                            // 0x0438 (size: 0x8)
    double Moon Texture Intensity (Day);                                              // 0x0440 (size: 0x8)
    double Moon Glow Intensity;                                                       // 0x0448 (size: 0x8)
    double Moon Glow Scale;                                                           // 0x0450 (size: 0x8)
    bool Render Moon Phases;                                                          // 0x0458 (size: 0x1)
    double Moon Phase Contrast;                                                       // 0x0460 (size: 0x8)
    bool Moon Phase Changes Over Time;                                                // 0x0468 (size: 0x1)
    double Dark Side Brightness;                                                      // 0x0470 (size: 0x8)
    TSoftObjectPtr<UTexture2D> Moon Phase Normal;                                     // 0x0478 (size: 0x28)
    bool Manually Position Sun Target;                                                // 0x04A0 (size: 0x1)
    double Sun Light Intensity;                                                       // 0x04A8 (size: 0x8)
    TEnumAsByte<EComponentMobility::Type> Sun Mobility;                               // 0x04B0 (size: 0x1)
    double Sun Yaw;                                                                   // 0x04B8 (size: 0x8)
    double Contrast;                                                                  // 0x04C0 (size: 0x8)
    double Sun Pitch;                                                                 // 0x04C8 (size: 0x8)
    double Sun Vertical Offset;                                                       // 0x04D0 (size: 0x8)
    bool Sun Casts Shadows;                                                           // 0x04D8 (size: 0x1)
    bool Sun Transmission;                                                            // 0x04D9 (size: 0x1)
    FLinearColor Sun Light Color;                                                     // 0x04DC (size: 0x10)
    double Soften Cloud Layer 1;                                                      // 0x04F0 (size: 0x8)
    double Soften Cloud Layer 2;                                                      // 0x04F8 (size: 0x8)
    double Sharpen Outer Edge;                                                        // 0x0500 (size: 0x8)
    double Stars Intensity;                                                           // 0x0508 (size: 0x8)
    FLinearColor Stars Color;                                                         // 0x0510 (size: 0x10)
    double Sun Scale;                                                                 // 0x0520 (size: 0x8)
    class UMaterialInstanceDynamic* Cloud Shadows MID;                                // 0x0528 (size: 0x8)
    bool Use Cloud Shadows;                                                           // 0x0530 (size: 0x1)
    double Cloud Shadows Intensity When Sunny;                                        // 0x0538 (size: 0x8)
    double Stars Speed;                                                               // 0x0540 (size: 0x8)
    double New Moon Light Brightness;                                                 // 0x0548 (size: 0x8)
    double Moon Source Angle Scale;                                                   // 0x0550 (size: 0x8)
    double Moon Texture Rotation;                                                     // 0x0558 (size: 0x8)
    TEnumAsByte<UDS_SkyLightMode::Type> Sky Light Mode;                               // 0x0560 (size: 0x1)
    bool Use Auroras;                                                                 // 0x0561 (size: 0x1)
    double Aurora Intensity;                                                          // 0x0568 (size: 0x8)
    double Aurora Speed;                                                              // 0x0570 (size: 0x8)
    double Cloud Shadows Intensity When Overcast;                                     // 0x0578 (size: 0x8)
    double Cloud Shadows Softness When Sunny;                                         // 0x0580 (size: 0x8)
    double Cloud Shadows Softness When Overcast;                                      // 0x0588 (size: 0x8)
    double Cloud Tiling;                                                              // 0x0590 (size: 0x8)
    double Soften Horizon;                                                            // 0x0598 (size: 0x8)
    bool One Cloud Layer;                                                             // 0x05A0 (size: 0x1)
    double Cloud Height;                                                              // 0x05A8 (size: 0x8)
    double Overcast Swirling Texture;                                                 // 0x05B0 (size: 0x8)
    double Saturation;                                                                // 0x05B8 (size: 0x8)
    double Directional Balance;                                                       // 0x05C0 (size: 0x8)
    double Dawn Time;                                                                 // 0x05C8 (size: 0x8)
    double Dusk Time;                                                                 // 0x05D0 (size: 0x8)
    double Night Brightness;                                                          // 0x05D8 (size: 0x8)
    double Sun Softness;                                                              // 0x05E0 (size: 0x8)
    double Aurora Phase;                                                              // 0x05E8 (size: 0x8)
    class UDirectionalLightComponent* Sun_LightComponent;                             // 0x05F0 (size: 0x8)
    class UDirectionalLightComponent* Moon_LightComponent;                            // 0x05F8 (size: 0x8)
    class USkyLightComponent* SkyLightComponent;                                      // 0x0600 (size: 0x8)
    class UExponentialHeightFogComponent* Height Fog Component;                       // 0x0608 (size: 0x8)
    bool Apply Exposure Settings;                                                     // 0x0610 (size: 0x1)
    TEnumAsByte<EAutoExposureMethod> Exposure Metering Mode;                          // 0x0611 (size: 0x1)
    class UCurveFloat* Exposure Compensation Curve;                                   // 0x0618 (size: 0x8)
    bool Animate Time Of Day;                                                         // 0x0620 (size: 0x1)
    double Day Length;                                                                // 0x0628 (size: 0x8)
    double Night Length;                                                              // 0x0630 (size: 0x8)
    FLinearColor Sun Disk Tint;                                                       // 0x0638 (size: 0x10)
    double Extend Dawn And Dusk;                                                      // 0x0648 (size: 0x8)
    double Base Fog Density;                                                          // 0x0650 (size: 0x8)
    double Foggy Density Contribution;                                                // 0x0658 (size: 0x8)
    double Cloudy Density Contribution;                                               // 0x0660 (size: 0x8)
    double Dust Density Contribution;                                                 // 0x0668 (size: 0x8)
    double Stars Tiling;                                                              // 0x0670 (size: 0x8)
    double Stars Daytime Intensity;                                                   // 0x0678 (size: 0x8)
    double Twinkle Amount;                                                            // 0x0680 (size: 0x8)
    double Twinkle Speed;                                                             // 0x0688 (size: 0x8)
    TSoftObjectPtr<UTexture2D> Tiling Stars Texture;                                  // 0x0690 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Real Stars Texture;                                    // 0x06B8 (size: 0x28)
    double Stars Phase;                                                               // 0x06E0 (size: 0x8)
    double Sky Light Intensity;                                                       // 0x06E8 (size: 0x8)
    TEnumAsByte<EComponentMobility::Type> Sky Light Mobility;                         // 0x06F0 (size: 0x1)
    double Sky Light Temperature;                                                     // 0x06F8 (size: 0x8)
    FLinearColor Sky Light Color Multiplier (Day);                                    // 0x0700 (size: 0x10)
    FLinearColor Sky Light Color Multiplier (Dawn/Dusk);                              // 0x0710 (size: 0x10)
    FLinearColor Sky Light Color Multiplier (Night);                                  // 0x0720 (size: 0x10)
    bool Real Time Capture;                                                           // 0x0730 (size: 0x1)
    bool Render Sky Light;                                                            // 0x0731 (size: 0x1)
    bool Move Sky Light Capture With Camera Location;                                 // 0x0732 (size: 0x1)
    bool Sky Light Movement Uses Z Axis;                                              // 0x0733 (size: 0x1)
    FLinearColor Sky Light Lower Hemisphere Tint (Capture Based);                     // 0x0734 (size: 0x10)
    FLinearColor Sky Light Lower Hemisphere Tint (Cubemap);                           // 0x0744 (size: 0x10)
    TSoftObjectPtr<UTextureCube> Sky Light Cubemap;                                   // 0x0758 (size: 0x28)
    double Sky Light Cubemap Angle;                                                   // 0x0780 (size: 0x8)
    class ASkyLight* Custom Sky Light Actor;                                          // 0x0788 (size: 0x8)
    bool Real Time Capture Uses Time Slicing;                                         // 0x0790 (size: 0x1)
    int32 Real Time Capture Time Slicing Cloud Faces Per Frame;                       // 0x0794 (size: 0x4)
    bool Static/Stationary Sky Light Casts Shadows;                                   // 0x0798 (size: 0x1)
    bool Movable Sky Light Casts Shadows (Enable DFAO);                               // 0x0799 (size: 0x1)
    bool Recapture Sky Light Periodically;                                            // 0x079A (size: 0x1)
    double Sky Light Recapture Period (Seconds);                                      // 0x07A0 (size: 0x8)
    bool Random Starting Time;                                                        // 0x07A8 (size: 0x1)
    double Sunrise Event Offset;                                                      // 0x07B0 (size: 0x8)
    double Sunset Event Offset;                                                       // 0x07B8 (size: 0x8)
    FUltra_Dynamic_Sky_CSunset Sunset;                                                // 0x07C0 (size: 0x10)
    void Sunset();
    FUltra_Dynamic_Sky_CSunrise Sunrise;                                              // 0x07D0 (size: 0x10)
    void Sunrise();
    double Cloud Wisps Opacity (Cloudy);                                              // 0x07E0 (size: 0x8)
    class UTexture2D* Cloud Wisps Texture;                                            // 0x07E8 (size: 0x8)
    TSoftObjectPtr<UTexture2D> 2D Dynamic Cloud Formation Texture;                    // 0x07F0 (size: 0x28)
    double Sun Shader Intensity;                                                      // 0x0818 (size: 0x8)
    double Directional Lighting Intensity;                                            // 0x0820 (size: 0x8)
    double Sun Highlight Radius Scale;                                                // 0x0828 (size: 0x8)
    double Cloud Opacity;                                                             // 0x0830 (size: 0x8)
    double Horizon Density Multiplier;                                                // 0x0838 (size: 0x8)
    double Zenith Density Multiplier;                                                 // 0x0840 (size: 0x8)
    double Latitude Gradient Position;                                                // 0x0848 (size: 0x8)
    double Latitude Gradient Width;                                                   // 0x0850 (size: 0x8)
    double Around Sun Density Multiplier;                                             // 0x0858 (size: 0x8)
    double Around Sun Density Exponent;                                               // 0x0860 (size: 0x8)
    double Around Moon Density Multiplier;                                            // 0x0868 (size: 0x8)
    double Around Moon Density Exponent;                                              // 0x0870 (size: 0x8)
    double 2D Clouds Shading Offset;                                                  // 0x0878 (size: 0x8)
    class UCurveFloat* Shine Intensity Curve;                                         // 0x0880 (size: 0x8)
    class UCurveFloat* Sun Highlight Intensity Curve;                                 // 0x0888 (size: 0x8)
    class UCurveFloat* Sun Highlight Radius Curve;                                    // 0x0890 (size: 0x8)
    bool Adjust For Path Tracer;                                                      // 0x0898 (size: 0x1)
    double Lights Update Period;                                                      // 0x08A0 (size: 0x8)
    double Lights Update Degree Threshold;                                            // 0x08A8 (size: 0x8)
    bool Dim Directional Lights With Cloud Coverage;                                  // 0x08B0 (size: 0x1)
    double Directional Lights Absent Brightness;                                      // 0x08B8 (size: 0x8)
    double Extra Night Brightness When Cloudy;                                        // 0x08C0 (size: 0x8)
    class UMaterialInstanceDynamic* Vol Clouds MID Complex;                           // 0x08C8 (size: 0x8)
    TEnumAsByte<UDS_VolRT_Mode::Type> Volumetric Cloud Rendering Mode;                // 0x08D0 (size: 0x1)
    double Bottom Altitude;                                                           // 0x08D8 (size: 0x8)
    double Volumetric Clouds Scale;                                                   // 0x08E0 (size: 0x8)
    double Layer Height Scale;                                                        // 0x08E8 (size: 0x8)
    double Cloud Formation Texture Scale;                                             // 0x08F0 (size: 0x8)
    double 3D Noise Scale;                                                            // 0x08F8 (size: 0x8)
    double 3D Erosion Intensity;                                                      // 0x0900 (size: 0x8)
    double High Frequency Noise Amount;                                               // 0x0908 (size: 0x8)
    double High Frequency Noise Distance Scale;                                       // 0x0910 (size: 0x8)
    int32 Max High Frequency Noise Levels;                                            // 0x0918 (size: 0x4)
    double Distort High Frequency Noise;                                              // 0x0920 (size: 0x8)
    double Extinction Scale;                                                          // 0x0928 (size: 0x8)
    double Base Floor Variation;                                                      // 0x0930 (size: 0x8)
    double Overcast Floor Variation;                                                  // 0x0938 (size: 0x8)
    double Floor Luminance Scale;                                                     // 0x0940 (size: 0x8)
    double View Sample Scale (Day);                                                   // 0x0948 (size: 0x8)
    double View Sample Scale (Night);                                                 // 0x0950 (size: 0x8)
    double Shadow Sample Scale;                                                       // 0x0958 (size: 0x8)
    double Shadow Tracing Distance;                                                   // 0x0960 (size: 0x8)
    double Tracing Max Distance (Inside Cloud Layer);                                 // 0x0968 (size: 0x8)
    double Tracing Max Distance (Outside Cloud Layer);                                // 0x0970 (size: 0x8)
    FLinearColor Volumetric Cloud Color;                                              // 0x0978 (size: 0x10)
    TSoftObjectPtr<UTexture> Cloud Profile LUT;                                       // 0x0988 (size: 0x28)
    TSoftObjectPtr<UTexture2D> Volumetric Cloud Formation Texture;                    // 0x09B0 (size: 0x28)
    double Minimum Erosion;                                                           // 0x09D8 (size: 0x8)
    double Close View Sample Ratio;                                                   // 0x09E0 (size: 0x8)
    double Cloud Formation Texture Mip Level;                                         // 0x09E8 (size: 0x8)
    double Reflection Sample Count Scale;                                             // 0x09F0 (size: 0x8)
    double Reflection Shadow Sample Count Scale;                                      // 0x09F8 (size: 0x8)
    double Volumetric Cloud Ambient Light Intensity;                                  // 0x0A00 (size: 0x8)
    FLinearColor Volumetric Cloud Ambient Light (Day);                                // 0x0A08 (size: 0x10)
    FLinearColor Volumetric Cloud Ambient Light (Dawn/Dusk);                          // 0x0A18 (size: 0x10)
    FLinearColor Volumetric Cloud Ambient Light (Night);                              // 0x0A28 (size: 0x10)
    double Volumetric Cloud Ambient Light Saturation;                                 // 0x0A38 (size: 0x8)
    double Multiscattering Light Intensity;                                           // 0x0A40 (size: 0x8)
    double Multiscattering Light Occlusion;                                           // 0x0A48 (size: 0x8)
    class UMaterialInstanceDynamic* Vol Clouds MID Simple;                            // 0x0A50 (size: 0x8)
    double Scale Fog Density;                                                         // 0x0A58 (size: 0x8)
    double Fog Start Distance When Clear;                                             // 0x0A60 (size: 0x8)
    double Fog Density Where Start Distance Reaches Zero;                             // 0x0A68 (size: 0x8)
    float Formation Change Speed;                                                     // 0x0A70 (size: 0x4)
    bool Randomize Cloud Formation On Run;                                            // 0x0A74 (size: 0x1)
    double 3D Noise Vertical Movement;                                                // 0x0A78 (size: 0x8)
    double Macro Variation;                                                           // 0x0A80 (size: 0x8)
    double Macro Scale;                                                               // 0x0A88 (size: 0x8)
    double Multiscattering Phase 1;                                                   // 0x0A90 (size: 0x8)
    double Multiscattering Phase 2;                                                   // 0x0A98 (size: 0x8)
    double Multiscattering Eccentricity;                                              // 0x0AA0 (size: 0x8)
    TArray<double> Custom Time Dispatchers;                                           // 0x0AA8 (size: 0x10)
    double Time Event Dispatcher Check Period;                                        // 0x0AB8 (size: 0x8)
    double Time Speed;                                                                // 0x0AC0 (size: 0x8)
    double Time Cycle Degrees;                                                        // 0x0AC8 (size: 0x8)
    class AActor* Ultra Dynamic Weather;                                              // 0x0AD0 (size: 0x8)
    double Tracing Max Start Distance;                                                // 0x0AD8 (size: 0x8)
    double Aurora Shape Change Speed;                                                 // 0x0AE0 (size: 0x8)
    double Aurora Texture Scale;                                                      // 0x0AE8 (size: 0x8)
    double Daytime Aurora Intensity;                                                  // 0x0AF0 (size: 0x8)
    FLinearColor Aurora Color 1;                                                      // 0x0AF8 (size: 0x10)
    FLinearColor Aurora Color 2;                                                      // 0x0B08 (size: 0x10)
    FLinearColor Aurora Color 3;                                                      // 0x0B18 (size: 0x10)
    class UMaterialInstanceDynamic* Volumetric Aurora MID;                            // 0x0B28 (size: 0x8)
    bool Half Rate Tick;                                                              // 0x0B30 (size: 0x1)
    int32 Half Rate Tick Framerate Threshold;                                         // 0x0B34 (size: 0x4)
    bool Disable All Runtime Updating;                                                // 0x0B38 (size: 0x1)
    bool Use Sky Mode Scalability Map;                                                // 0x0B39 (size: 0x1)
    TMap<int32, TEnumAsByte<UDS_SkyMode::Type>> Sky Mode Scalability Map;             // 0x0B40 (size: 0x50)
    double Sun Disk Intensity;                                                        // 0x0B90 (size: 0x8)
    class UMaterialInstanceDynamic* Inside Clouds Fog MID;                            // 0x0B98 (size: 0x8)
    bool Enable Fog Inside Clouds;                                                    // 0x0BA0 (size: 0x1)
    double Aurora Sky Light/Reflection Brightness;                                    // 0x0BA8 (size: 0x8)
    TSoftObjectPtr<UTexture2D> Aurora Texture;                                        // 0x0BB0 (size: 0x28)
    double 2D Aurora Max Samples;                                                     // 0x0BD8 (size: 0x8)
    double 2D Aurora Sample Step Size;                                                // 0x0BE0 (size: 0x8)
    double 2D Aurora Line Exponent;                                                   // 0x0BE8 (size: 0x8)
    double 2D Aurora Mask Exponent;                                                   // 0x0BF0 (size: 0x8)
    TEnumAsByte<UDS_VolRT_Mode::Type> Volumetric Aurora Rendering Mode;               // 0x0BF8 (size: 0x1)
    double Volumetric Aurora Sample Count Scale;                                      // 0x0C00 (size: 0x8)
    double Volumetric Aurora Layer Height;                                            // 0x0C08 (size: 0x8)
    double Volumetric Aurora Bottom Altitude;                                         // 0x0C10 (size: 0x8)
    double Fog Density Daytime Mutliplier;                                            // 0x0C18 (size: 0x8)
    double Fog Density Nighttime Multiplier;                                          // 0x0C20 (size: 0x8)
    double Base Height Fog Falloff;                                                   // 0x0C28 (size: 0x8)
    double Cloudy Height Fog Falloff;                                                 // 0x0C30 (size: 0x8)
    double Foggy Height Fog Falloff;                                                  // 0x0C38 (size: 0x8)
    double Inside Cloud Fog Strength;                                                 // 0x0C40 (size: 0x8)
    FLinearColor Inside Cloud Fog Color;                                              // 0x0C48 (size: 0x10)
    double 2D Overcast Turbulence;                                                    // 0x0C58 (size: 0x8)
    double Close Fade Distance;                                                       // 0x0C60 (size: 0x8)
    double Close Fade Offset;                                                         // 0x0C68 (size: 0x8)
    bool Two Layers;                                                                  // 0x0C70 (size: 0x1)
    double Layer 2 Coverage Scale;                                                    // 0x0C78 (size: 0x8)
    double Layer 2 Extinction Scale;                                                  // 0x0C80 (size: 0x8)
    FVector2D Layer 2 Cloud Scale;                                                    // 0x0C88 (size: 0x10)
    double Layer 2 Mip Offset;                                                        // 0x0C98 (size: 0x8)
    double Distance Between Layers;                                                   // 0x0CA0 (size: 0x8)
    bool Enable Sun Light Shaft Bloom;                                                // 0x0CA8 (size: 0x1)
    FVector2D Sun Light Shaft Bloom Scale;                                            // 0x0CB0 (size: 0x10)
    FVector2D Sun Light Shaft Max Brightness;                                         // 0x0CC0 (size: 0x10)
    FVector2D Sun Light Shaft Bloom Threshold;                                        // 0x0CD0 (size: 0x10)
    FLinearColor Sun Light Shaft Tint Color;                                          // 0x0CE0 (size: 0x10)
    bool Enable Moon Light Shaft Bloom;                                               // 0x0CF0 (size: 0x1)
    FVector2D Moon Light Shaft Bloom Scale;                                           // 0x0CF8 (size: 0x10)
    FVector2D Moon Light Shaft Max Brightness;                                        // 0x0D08 (size: 0x10)
    FVector2D Moon Light Shaft Bloom Threshold;                                       // 0x0D18 (size: 0x10)
    FLinearColor Moon Light Shaft Tint Color;                                         // 0x0D28 (size: 0x10)
    TEnumAsByte<UDS_SkyMode::Type> Volumetric Clouds Replacement;                     // 0x0D38 (size: 0x1)
    TEnumAsByte<UDS_SkyLightMode::Type> Real Time Capture Sky Light Replacement;      // 0x0D39 (size: 0x1)
    TEnumAsByte<UDS_SkyMode::Type> Volumetric Aurora Replacement;                     // 0x0D3A (size: 0x1)
    TMap<FString, TEnumAsByte<UDS_RenderingFeatureLevel::Type>> Platform Feature Levels; // 0x0D40 (size: 0x50)
    bool Simulate Real Sun;                                                           // 0x0D90 (size: 0x1)
    bool Simulate Real Moon;                                                          // 0x0D91 (size: 0x1)
    bool Simulate Real Stars;                                                         // 0x0D92 (size: 0x1)
    TEnumAsByte<UDS_CityPresets::Type> Location Preset;                               // 0x0D93 (size: 0x1)
    double Latitude;                                                                  // 0x0D98 (size: 0x8)
    double Longitude;                                                                 // 0x0DA0 (size: 0x8)
    double Time Zone;                                                                 // 0x0DA8 (size: 0x8)
    int32 Month;                                                                      // 0x0DB0 (size: 0x4)
    int32 Day;                                                                        // 0x0DB4 (size: 0x4)
    int32 Year;                                                                       // 0x0DB8 (size: 0x4)
    double North Yaw;                                                                 // 0x0DC0 (size: 0x8)
    double Simulation Speed;                                                          // 0x0DC8 (size: 0x8)
    bool Use System Time;                                                             // 0x0DD0 (size: 0x1)
    bool Apply Daylight Savings Time;                                                 // 0x0DD1 (size: 0x1)
    class UUDS_Calendar_C* Calendar;                                                  // 0x0DD8 (size: 0x8)
    double Simulation Speed Night Multiplier;                                         // 0x0DE0 (size: 0x8)
    int32 DST Start Month;                                                            // 0x0DE8 (size: 0x4)
    int32 DST Start Day;                                                              // 0x0DEC (size: 0x4)
    int32 DST End Month;                                                              // 0x0DF0 (size: 0x4)
    int32 DST End Day;                                                                // 0x0DF4 (size: 0x4)
    int32 DST Change Hour;                                                            // 0x0DF8 (size: 0x4)
    double Stellar Calibration;                                                       // 0x0E00 (size: 0x8)
    double Lunar Orbit Calibration;                                                   // 0x0E08 (size: 0x8)
    double Lunar Inclination Calibration;                                             // 0x0E10 (size: 0x8)
    bool Daylight Savings Time;                                                       // 0x0E18 (size: 0x1)
    int32 Total Days Elapsed;                                                         // 0x0E1C (size: 0x4)
    bool Clouds Move With Time Of Day;                                                // 0x0E20 (size: 0x1)
    double Time Of Day Movement Multiplier;                                           // 0x0E28 (size: 0x8)
    TMap<class FString, class TSoftObjectPtr<UMaterialInstance>> Sky MID Parent Instances; // 0x0E30 (size: 0x50)
    double Fog Shadows;                                                               // 0x0E80 (size: 0x8)
    double Dust Shadows;                                                              // 0x0E88 (size: 0x8)
    double 2D Cloud Shadows Speed;                                                    // 0x0E90 (size: 0x8)
    double 2D Cloud Shadows Scale;                                                    // 0x0E98 (size: 0x8)
    double 2D Cloud Shadows Light Angle Offset Scale;                                 // 0x0EA0 (size: 0x8)
    bool Disable Directional Light Shadows When Fully Shadowed By Clouds;             // 0x0EA8 (size: 0x1)
    class UMaterialInterface* Custom Light Function Material;                         // 0x0EB0 (size: 0x8)
    bool Force Light Functions On;                                                    // 0x0EB8 (size: 0x1)
    double Time Of Day Replication Period;                                            // 0x0EC0 (size: 0x8)
    double Replicated Time of Day;                                                    // 0x0EC8 (size: 0x8)
    bool Render Moon Directional Light;                                               // 0x0ED0 (size: 0x1)
    class ADirectionalLight* Custom Moon Light Actor;                                 // 0x0ED8 (size: 0x8)
    double Scale Moon Radius As It Nears Horizon;                                     // 0x0EE0 (size: 0x8)
    bool Fog Colors from Sky Atmosphere;                                              // 0x0EE8 (size: 0x1)
    double Dusty Height Fog Falloff;                                                  // 0x0EF0 (size: 0x8)
    double Moon Specular Scale;                                                       // 0x0EF8 (size: 0x8)
    double Ambient Light From Sky Atmosphere;                                         // 0x0F00 (size: 0x8)
    double Volumetric Cloud Ambient Light Bottom Scale;                               // 0x0F08 (size: 0x8)
    double Volumetric Cloud Ambient Light Top Scale;                                  // 0x0F10 (size: 0x8)
    bool Change To Simplified Material When Overcast;                                 // 0x0F18 (size: 0x1)
    double Simplified Material Cloud Coverage Threshold;                              // 0x0F20 (size: 0x8)
    double Simplified Material Fade Length;                                           // 0x0F28 (size: 0x8)
    double Scale View Samples When Overcast;                                          // 0x0F30 (size: 0x8)
    int32 Current Volumetric Clouds MID;                                              // 0x0F38 (size: 0x4)
    FVector Clouds Position;                                                          // 0x0F40 (size: 0x18)
    FVector Cloud Phase Vector Multiplier;                                            // 0x0F58 (size: 0x18)
    FLinearColor Rayleigh Scattering Color (Day);                                     // 0x0F70 (size: 0x10)
    FLinearColor Rayleigh Scattering Color (Dawn/Dusk);                               // 0x0F80 (size: 0x10)
    FLinearColor Rayleigh Scattering Color (Night);                                   // 0x0F90 (size: 0x10)
    double Desaturate Rayleigh Scattering When Cloudy;                                // 0x0FA0 (size: 0x8)
    double Current Time of Day Offset;                                                // 0x0FA8 (size: 0x8)
    double Last Frame Time of Day;                                                    // 0x0FB0 (size: 0x8)
    double Time of Day Change Speed;                                                  // 0x0FB8 (size: 0x8)
    TMap<FName, TEnumAsByte<UDS_PropertyType::Type>> Properties;                      // 0x0FC0 (size: 0x50)
    double Night Sky Glow;                                                            // 0x1010 (size: 0x8)
    FLinearColor Night Sky Glow Color;                                                // 0x1018 (size: 0x10)
    double Light Pollution Intensity;                                                 // 0x1028 (size: 0x8)
    FLinearColor Light Pollution Color;                                               // 0x1030 (size: 0x10)
    class UMaterialInstanceDynamic* Cloud Fog Post Process MID;                       // 0x1040 (size: 0x8)
    FFloatRange Dimming Range;                                                        // 0x1048 (size: 0x10)
    double Dimming Range Exponent;                                                    // 0x1058 (size: 0x8)
    class UMaterialInterface* Custom Sky Sphere Material;                             // 0x1060 (size: 0x8)
    double Fog Snow Contribution;                                                     // 0x1068 (size: 0x8)
    FUltra_Dynamic_Sky_CMidnight Midnight;                                            // 0x1070 (size: 0x10)
    void Midnight();
    FLinearColor Sunset/Sunrise Color (Absorption);                                   // 0x1080 (size: 0x10)
    double Sunset/Sunrise Color Intensity (Absorption Scale);                         // 0x1090 (size: 0x8)
    double Simulated Sunrise Time;                                                    // 0x1098 (size: 0x8)
    double Simulated Sunset Time;                                                     // 0x10A0 (size: 0x8)
    double Base Cloud Height;                                                         // 0x10A8 (size: 0x8)
    bool Enable Sun Lens Flare;                                                       // 0x10B0 (size: 0x1)
    TEnumAsByte<UDS_LensFlareType::Type> Lens Flare Type;                             // 0x10B1 (size: 0x1)
    double Lens Flare Strength;                                                       // 0x10B8 (size: 0x8)
    FLinearColor Lens Flare Tint;                                                     // 0x10C0 (size: 0x10)
    class UMaterialInstanceDynamic* Lens Flare MID;                                   // 0x10D0 (size: 0x8)
    double Lens Flare Brightness Threshold;                                           // 0x10D8 (size: 0x8)
    class UMaterialInterface* Custom Lens Flare Parent Instance;                      // 0x10E0 (size: 0x8)
    double Scale Flare Elements;                                                      // 0x10E8 (size: 0x8)
    double Dynamic Sky Light Transition Time;                                         // 0x10F0 (size: 0x8)
    double Target Sky Light Multiplier;                                               // 0x10F8 (size: 0x8)
    double Dynamic Sky Light Multiplier;                                              // 0x1100 (size: 0x8)
    double Cloud Coverage 0-3;                                                        // 0x1108 (size: 0x8)
    double Global Overcast 0-1;                                                       // 0x1110 (size: 0x8)
    double Local Overcast 0-1;                                                        // 0x1118 (size: 0x8)
    bool Override with New Changes;                                                   // 0x1120 (size: 0x1)
    class UMaterialInstanceDynamic* Overcast Turbulence MID;                          // 0x1128 (size: 0x8)
    double Scale View Samples When Camera Is in Cloud Layer;                          // 0x1130 (size: 0x8)
    double Low Material Quality Sample Count Scale;                                   // 0x1138 (size: 0x8)
    double Medium Material Quality Sample Count Scale;                                // 0x1140 (size: 0x8)
    double Epic Material Quality Sample Count Scale;                                  // 0x1148 (size: 0x8)
    TSoftObjectPtr<UVolumeTexture> Epic Quality Volume Texture;                       // 0x1150 (size: 0x28)
    TSoftObjectPtr<UVolumeTexture> High Quality Volume Texture;                       // 0x1178 (size: 0x28)
    TSoftObjectPtr<UVolumeTexture> Low Quality Volume Texture;                        // 0x11A0 (size: 0x28)
    TSoftObjectPtr<UMaterialInterface> Inside Cloud Fog Parent Material;              // 0x11C8 (size: 0x28)
    TSoftObjectPtr<UMaterialInterface> Post Process Cloud Fog Parent Material;        // 0x11F0 (size: 0x28)
    TArray<class UMaterialInstanceDynamic*> Volumetric Cloud MIDs;                    // 0x1218 (size: 0x10)
    double Moon Light Current Intensity Value;                                        // 0x1228 (size: 0x8)
    FLinearColor Twilight Color (Absorption);                                         // 0x1230 (size: 0x10)
    double Twilight Color Intensity (Absorption Scale);                               // 0x1240 (size: 0x8)
    FLinearColor Base Sky Color (Day);                                                // 0x1248 (size: 0x10)
    FLinearColor Base Sky Color (Dawn/Dusk);                                          // 0x1258 (size: 0x10)
    FLinearColor Base Sky Color (Night);                                              // 0x1268 (size: 0x10)
    FLinearColor Cloud Light Color (Day);                                             // 0x1278 (size: 0x10)
    FLinearColor Cloud Light Color (Dawn/Dusk);                                       // 0x1288 (size: 0x10)
    FLinearColor Cloud Light Color (Night);                                           // 0x1298 (size: 0x10)
    FLinearColor Cloud Dark Color (Day);                                              // 0x12A8 (size: 0x10)
    FLinearColor Cloud Dark Color (Dawn/Dusk);                                        // 0x12B8 (size: 0x10)
    FLinearColor Cloud Dark Color (Night);                                            // 0x12C8 (size: 0x10)
    class UCurveFloat* Directional Intensity Curve;                                   // 0x12D8 (size: 0x8)
    class UCurveLinearColor* Directional Light Scattering Curve;                      // 0x12E0 (size: 0x8)
    bool Render Exponential Height Fog;                                               // 0x12E8 (size: 0x1)
    class AExponentialHeightFog* Custom Height Fog Actor;                             // 0x12F0 (size: 0x8)
    TEnumAsByte<UDS_FogColorMode::Type> Fog Color Mode;                               // 0x12F8 (size: 0x1)
    double Fog Color Intensity Scale;                                                 // 0x1300 (size: 0x8)
    double Overcast Brightness Day;                                                   // 0x1308 (size: 0x8)
    double Overcast Brightness Night;                                                 // 0x1310 (size: 0x8)
    double Sky Atmosphere Fog Influence Sun;                                          // 0x1318 (size: 0x8)
    double Sky Atmosphere Fog Influence Moon;                                         // 0x1320 (size: 0x8)
    double Sky Atmosphere Fog Influence None;                                         // 0x1328 (size: 0x8)
    class UCurveLinearColor* Fog Inscattering Color Curve;                            // 0x1330 (size: 0x8)
    FLinearColor Fog Inscattering Sun;                                                // 0x1338 (size: 0x10)
    FLinearColor Fog Inscattering Moon;                                               // 0x1348 (size: 0x10)
    class UCurveLinearColor* Fog Directional Inscattering Color Curve;                // 0x1358 (size: 0x8)
    FLinearColor Fog Directional Inscattering;                                        // 0x1360 (size: 0x10)
    double Foggy Desaturation;                                                        // 0x1370 (size: 0x8)
    double Overcast Desaturation;                                                     // 0x1378 (size: 0x8)
    FLinearColor All Fog Colors Multiplier;                                           // 0x1380 (size: 0x10)
    double Dust Amount;                                                               // 0x1390 (size: 0x8)
    FLinearColor Dust Color;                                                          // 0x1398 (size: 0x10)
    bool Use Volumetric Fog;                                                          // 0x13A8 (size: 0x1)
    double Volumetric Fog Distance;                                                   // 0x13B0 (size: 0x8)
    double Volumetric Fog Extinction;                                                 // 0x13B8 (size: 0x8)
    double Sun Volumetric Scattering Intensity;                                       // 0x13C0 (size: 0x8)
    double Moon Volumetric Scattering Intensity;                                      // 0x13C8 (size: 0x8)
    FLinearColor Volumetric Fog Albedo (Day);                                         // 0x13D0 (size: 0x10)
    FLinearColor Volumetric Fog Albedo (Dawn/Dusk);                                   // 0x13E0 (size: 0x10)
    FLinearColor Volumetric Fog Albedo (Night);                                       // 0x13F0 (size: 0x10)
    bool Disable Height Fog Above Volumetric Cloud Layer;                             // 0x1400 (size: 0x1)
    float Cached Height Fog Density;                                                  // 0x1404 (size: 0x4)
    bool Using Cloud Fog Post Process;                                                // 0x1408 (size: 0x1)
    FVector Current Camera Location;                                                  // 0x1410 (size: 0x18)
    FLinearColor Ambient Fog Color;                                                   // 0x1428 (size: 0x10)
    FLinearColor Directional Base Fog Color;                                          // 0x1438 (size: 0x10)
    FLinearColor Scaled Directional Base Fog Color;                                   // 0x1448 (size: 0x10)
    TSoftObjectPtr<UMaterialInterface> Volumetric Aurora Parent Material;             // 0x1458 (size: 0x28)
    bool Using Inside Cloud Fog;                                                      // 0x1480 (size: 0x1)
    TSoftObjectPtr<UMaterialInterface> Overcast Turbulence Parent Material;           // 0x1488 (size: 0x28)
    bool Forward Shading;                                                             // 0x14B0 (size: 0x1)
    FUltra_Dynamic_Sky_CHourly Hourly;                                                // 0x14B8 (size: 0x10)
    void Hourly(int32 Hour);
    int32 Event Hour;                                                                 // 0x14C8 (size: 0x4)
    double Cloud Wisps Color Intensity;                                               // 0x14D0 (size: 0x8)
    double Max Moon Source Angle Scale;                                               // 0x14D8 (size: 0x8)
    double Transition Time A;                                                         // 0x14E0 (size: 0x8)
    double Transition Time B;                                                         // 0x14E8 (size: 0x8)
    bool Transitioning Time;                                                          // 0x14F0 (size: 0x1)
    TEnumAsByte<EEasingFunc::Type> Transition Easing Function;                        // 0x14F1 (size: 0x1)
    double Transition Easing Exponent;                                                // 0x14F8 (size: 0x8)
    FTimerHandle Transition Timer;                                                    // 0x1500 (size: 0x8)
    double Transition Duration;                                                       // 0x1508 (size: 0x8)
    int32 Transition Days Counted;                                                    // 0x1510 (size: 0x4)
    bool Transition Can Go Backwards;                                                 // 0x1514 (size: 0x1)
    double Moon Source Angle Softness;                                                // 0x1518 (size: 0x8)
    double Exposure Bias Day;                                                         // 0x1520 (size: 0x8)
    double Exposure Bias Dawn/Dusk;                                                   // 0x1528 (size: 0x8)
    double Exposure Bias Night;                                                       // 0x1530 (size: 0x8)
    double Exposure Bias Cloudy;                                                      // 0x1538 (size: 0x8)
    double Exposure Bias Foggy;                                                       // 0x1540 (size: 0x8)
    double Exposure Bias Dusty;                                                       // 0x1548 (size: 0x8)
    FFloatRange Exposure Brightness Range;                                            // 0x1550 (size: 0x10)
    bool Apply Interior Adjustments;                                                  // 0x1560 (size: 0x1)
    double Extra Fog Start Distance In Interior;                                      // 0x1568 (size: 0x8)
    double Fog Density Multiplier In Interior;                                        // 0x1570 (size: 0x8)
    double Exposure Bias In Interior;                                                 // 0x1578 (size: 0x8)
    double Sky Light Intensity Multiplier In Interiors;                               // 0x1580 (size: 0x8)
    double Sun Light Intensity Multiplier In Interiors;                               // 0x1588 (size: 0x8)
    double Moon Light Intensity Multiplier In Interiors;                              // 0x1590 (size: 0x8)
    double Extra Sun Volumetric Scattering In Interiors;                              // 0x1598 (size: 0x8)
    double Extra Moon Volumetric Scattering In Interiors;                             // 0x15A0 (size: 0x8)
    double Cached Inverted Global Occlusion;                                          // 0x15A8 (size: 0x8)
    class UUDS_OcclusionSettings_C* Occlusion Settings;                               // 0x15B0 (size: 0x8)
    double Cloud Shadow Disable Threshold;                                            // 0x15B8 (size: 0x8)
    double Cloud Bottom World Height;                                                 // 0x15C0 (size: 0x8)
    double Cached Night Filter;                                                       // 0x15C8 (size: 0x8)
    TArray<double> Cached Floats Old;                                                 // 0x15D0 (size: 0x10)
    TArray<double> Cached Floats New;                                                 // 0x15E0 (size: 0x10)
    double Cache Alpha;                                                               // 0x15F0 (size: 0x8)
    bool Filling Starting Cache;                                                      // 0x15F8 (size: 0x1)
    TArray<FLinearColor> Cached Colors Old;                                           // 0x1600 (size: 0x10)
    TArray<FLinearColor> Cached Colors New;                                           // 0x1610 (size: 0x10)
    TArray<FVector> Cached Vectors Old;                                               // 0x1620 (size: 0x10)
    TArray<FVector> Cached Vectors New;                                               // 0x1630 (size: 0x10)
    FVector Cached Sun Vector;                                                        // 0x1640 (size: 0x18)
    FVector Cached Moon Vector;                                                       // 0x1658 (size: 0x18)
    TArray<bool> Cached Value Changing;                                               // 0x1670 (size: 0x10)
    double Max Property Cache Period;                                                 // 0x1680 (size: 0x8)
    TMap<TEnumAsByte<UDS_CityPresets::Type>, FVector> Preset Location Coordinates;    // 0x1688 (size: 0x50)
    bool Disable Image Based Lens Flares When Enabled;                                // 0x16D8 (size: 0x1)
    double Starting Sky Atmosphere Height;                                            // 0x16E0 (size: 0x8)
    TArray<FUDS_Post_Process_Stage> Post Process Components;                          // 0x16E8 (size: 0x10)
    FPostProcessSettings Static Post Process Settings;                                // 0x1700 (size: 0x760)
    TArray<class UPostProcessComponent*> User Post Process Components;                // 0x1E60 (size: 0x10)
    bool Using Post Process Components;                                               // 0x1E70 (size: 0x1)
    FLinearColor Cloud Wisps Tint (Day);                                              // 0x1E74 (size: 0x10)
    FLinearColor Cloud Wisps Tint (Dawn/Dusk);                                        // 0x1E84 (size: 0x10)
    FLinearColor Cloud Wisps Tint (Night);                                            // 0x1E94 (size: 0x10)
    double Increase Wisps Brightness Around Sun;                                      // 0x1EA8 (size: 0x8)
    double Increase Wisps Brightness Around Moon;                                     // 0x1EB0 (size: 0x8)
    double Sun Source Angle Scale;                                                    // 0x1EB8 (size: 0x8)
    bool Solar Eclipse;                                                               // 0x1EC0 (size: 0x1)
    FLinearColor Solar Eclipse Tint Color;                                            // 0x1EC4 (size: 0x10)
    double Solar Eclipse Intensity Multiplier;                                        // 0x1ED8 (size: 0x8)
    double Sun Specular Scale;                                                        // 0x1EE0 (size: 0x8)
    bool Render Sun Directional Light;                                                // 0x1EE8 (size: 0x1)
    class ADirectionalLight* Custom Sun Light Actor;                                  // 0x1EF0 (size: 0x8)
    double Max Sun Source Angle Scale;                                                // 0x1EF8 (size: 0x8)
    double Sun Source Angle Softness;                                                 // 0x1F00 (size: 0x8)
    double Scale Sun Radius As It Nears Horizon;                                      // 0x1F08 (size: 0x8)
    bool Fade Down High Sun Light Intensity Below Horizon;                            // 0x1F10 (size: 0x1)
    bool Support Sky Atmo Affecting Height Fog;                                       // 0x1F11 (size: 0x1)
    FString UDS Version;                                                              // 0x1F18 (size: 0x10)
    class UUDS_VersionInfo_C* UDS Version Info;                                       // 0x1F28 (size: 0x8)
    double Clouds B Time;                                                             // 0x1F30 (size: 0x8)
    double Sky Atmosphere Overcast Luminance;                                         // 0x1F38 (size: 0x8)
    bool Keep Planet Top At Camera XY Location;                                       // 0x1F40 (size: 0x1)
    bool Control Sky Atmosphere Settings;                                             // 0x1F41 (size: 0x1)
    FVector Old Composite Weather;                                                    // 0x1F48 (size: 0x18)
    FVector Old Composite Context;                                                    // 0x1F60 (size: 0x18)
    double Composite Weather Change Speed;                                            // 0x1F78 (size: 0x8)
    double Composite Context Change Speed;                                            // 0x1F80 (size: 0x8)
    FVector Old Moon Target;                                                          // 0x1F88 (size: 0x18)
    FVector Old Sun Target;                                                           // 0x1FA0 (size: 0x18)
    double Cache Current Timer;                                                       // 0x1FB8 (size: 0x8)
    FVector Last Low Frequency Update Location;                                       // 0x1FC0 (size: 0x18)
    class UUDS_Planet_Preset_C* Add Planet/Moon Preset;                               // 0x1FD8 (size: 0x8)
    TArray<FUDS_Space_Planet> Planets/Moons;                                          // 0x1FE0 (size: 0x10)
    double Space Layer Brightness (Night);                                            // 0x1FF0 (size: 0x8)
    double Space Layer Brightness (Day);                                              // 0x1FF8 (size: 0x8)
    double Space Glow Brightness;                                                     // 0x2000 (size: 0x8)
    TArray<class UMaterialInstanceDynamic*> Space Planet MIDs;                        // 0x2008 (size: 0x10)
    bool Render Nebula;                                                               // 0x2018 (size: 0x1)
    double Nebula Intensity;                                                          // 0x2020 (size: 0x8)
    FLinearColor Nebula Color 1;                                                      // 0x2028 (size: 0x10)
    FLinearColor Nebula Color 2;                                                      // 0x2038 (size: 0x10)
    FLinearColor Nebula Color 3;                                                      // 0x2048 (size: 0x10)
    double Nebula Core Highlight;                                                     // 0x2058 (size: 0x8)
    double Nebula Noise Scale;                                                        // 0x2060 (size: 0x8)
    double Nebula Exponent;                                                           // 0x2068 (size: 0x8)
    double Nebula Large Distortion;                                                   // 0x2070 (size: 0x8)
    double Nebula Small Distortion;                                                   // 0x2078 (size: 0x8)
    double Nebula Noise Offset;                                                       // 0x2080 (size: 0x8)
    int32 Nebula Sort Index;                                                          // 0x2088 (size: 0x4)
    bool Moon Renders Behind Space Layer;                                             // 0x208C (size: 0x1)
    bool Force Enable Space Layer;                                                    // 0x208D (size: 0x1)
    TArray<class USceneComponent*> Space Scene Components;                            // 0x2090 (size: 0x10)
    TArray<class UMaterialInstanceDynamic*> Space Ring MIDs;                          // 0x20A0 (size: 0x10)
    TArray<class UMaterialInstanceDynamic*> Space Glow MIDs;                          // 0x20B0 (size: 0x10)
    TArray<class UStaticMeshComponent*> Space Planet Components;                      // 0x20C0 (size: 0x10)
    bool Space Layer Active;                                                          // 0x20D0 (size: 0x1)
    FLinearColor Cached Solar Eclipse Tint;                                           // 0x20D4 (size: 0x10)
    double Cached Sun Scale;                                                          // 0x20E8 (size: 0x8)
    double Cached Moon Scale;                                                         // 0x20F0 (size: 0x8)
    bool Sun - Lighting Channel 0;                                                    // 0x20F8 (size: 0x1)
    bool Sun - Lighting Channel 1;                                                    // 0x20F9 (size: 0x1)
    bool Sun - Lighting Channel 2;                                                    // 0x20FA (size: 0x1)
    bool Moon - Lighting Channel 0;                                                   // 0x20FB (size: 0x1)
    bool Moon - Lighting Channel 1;                                                   // 0x20FC (size: 0x1)
    bool Moon - Lighting Channel 2;                                                   // 0x20FD (size: 0x1)
    TArray<class USceneComponent*> Space Roots;                                       // 0x2100 (size: 0x10)
    double Water Level;                                                               // 0x2110 (size: 0x8)
    bool Render Water Caustics;                                                       // 0x2118 (size: 0x1)
    double Caustics Intensity;                                                        // 0x2120 (size: 0x8)
    double Caustics Falloff;                                                          // 0x2128 (size: 0x8)
    double Deep Water Falloff;                                                        // 0x2130 (size: 0x8)
    double Caustics Texture Scale;                                                    // 0x2138 (size: 0x8)
    double Moons Cloud Mask;                                                          // 0x2140 (size: 0x8)
    double Blur Caustics With Depth;                                                  // 0x2148 (size: 0x8)
    double Blur Caustics In Cloud Shadow;                                             // 0x2150 (size: 0x8)
    double Blur Caustics With Camera Distance;                                        // 0x2158 (size: 0x8)
    int32 Event Minute;                                                               // 0x2160 (size: 0x4)
    int32 Sunset Event State;                                                         // 0x2164 (size: 0x4)
    bool Disable Sky/Fog Cloudiness Above Cloud Layer;                                // 0x2168 (size: 0x1)
    TSoftObjectPtr<UMaterialInterface> Custom Volumetric Cloud Material;              // 0x2170 (size: 0x28)
    double Camera Cloud Layer Normalized Height;                                      // 0x2198 (size: 0x8)
    double Camera Sky Atmosphere Normalized Density;                                  // 0x21A0 (size: 0x8)
    FLinearColor Moon Fog Base Color;                                                 // 0x21A8 (size: 0x10)
    FLinearColor Sun Fog Base Color;                                                  // 0x21B8 (size: 0x10)
    FVector Last High Frequency Update Location;                                      // 0x21C8 (size: 0x18)
    double Old Cloud Layer Camera Level;                                              // 0x21E0 (size: 0x8)
    double Cloud Camera Relative Change Speed;                                        // 0x21E8 (size: 0x8)
    FLinearColor Cached Sky Atmosphere Absorption Color;                              // 0x21F0 (size: 0x10)
    int32 Cloud Coverage Target Resolution;                                           // 0x2200 (size: 0x4)
    class UTextureRenderTarget2D* Cloud Coverage Render Target;                       // 0x2208 (size: 0x8)
    int32 Cloud Coverage Target Size;                                                 // 0x2210 (size: 0x4)
    double Painted Cloud Coverage Opacity;                                            // 0x2218 (size: 0x8)
    double Layer 2 Painted Cloud Coverage Opacity;                                    // 0x2220 (size: 0x8)
    double Painted Coverage Affects Global Values;                                    // 0x2228 (size: 0x8)
    TMap<class FIntPoint, class UUDS_Cloud_Paint_Cell_C*> Local Painting Cell Data;   // 0x2230 (size: 0x50)
    int32 Local Painted Cell Size;                                                    // 0x2280 (size: 0x4)
    bool Cloud Painting Active;                                                       // 0x2284 (size: 0x1)
    FVector2D Cloud Coverage Target Location;                                         // 0x2288 (size: 0x10)
    FLinearColor Current Cloud Coverage Render Target Mapping;                        // 0x2298 (size: 0x10)
    bool Cloud Coverage Target in Use;                                                // 0x22A8 (size: 0x1)
    TArray<TSoftObjectPtr<UObject>> Async Loading Queue;                              // 0x22B0 (size: 0x10)
    TArray<class UObject*> Async Loaded Objects;                                      // 0x22C0 (size: 0x10)
    bool Async Loading Active;                                                        // 0x22D0 (size: 0x1)
    double Cloud Coverage After Painting;                                             // 0x22D8 (size: 0x8)
    bool Cloud Paint Can Add Coverage;                                                // 0x22E0 (size: 0x1)
    bool Cloud Paint Can Subtract Coverage;                                           // 0x22E1 (size: 0x1)
    bool Enable Volumetric Cloud Light Rays;                                          // 0x22E2 (size: 0x1)
    double Light Ray Intensity;                                                       // 0x22E8 (size: 0x8)
    FLinearColor Light Ray Tint Color;                                                // 0x22F0 (size: 0x10)
    double Light Rays Point Spacing;                                                  // 0x2300 (size: 0x8)
    double Light Ray Length;                                                          // 0x2308 (size: 0x8)
    double Individual Clouds Light Rays;                                              // 0x2310 (size: 0x8)
    double Scale Light Ray Width;                                                     // 0x2318 (size: 0x8)
    double Light Rays Max Distance (Km);                                              // 0x2320 (size: 0x8)
    double Light Rays Depth Fade Distance;                                            // 0x2328 (size: 0x8)
    double Light Rays 3D Noise Scale;                                                 // 0x2330 (size: 0x8)
    TSoftObjectPtr<UNiagaraSystem> Volumetric Cloud Light Rays Niagara System;        // 0x2338 (size: 0x28)
    double Max Light Ray Length;                                                      // 0x2360 (size: 0x8)
    double Cloud Top World Height;                                                    // 0x2368 (size: 0x8)
    FVector Cached Light Ray Vector;                                                  // 0x2370 (size: 0x18)
    bool Light Rays Using Sun;                                                        // 0x2388 (size: 0x1)
    double Cached Light Ray Strength;                                                 // 0x2390 (size: 0x8)
    class UMaterialInstanceDynamic* Space Nebula MID;                                 // 0x2398 (size: 0x8)
    class UMaterialInstanceDynamic* Cloud Paint Draw MID;                             // 0x23A0 (size: 0x8)
    bool Render Global Volumetric Material;                                           // 0x23A8 (size: 0x1)
    double Fog Noise Scale;                                                           // 0x23B0 (size: 0x8)
    double Fog Noise Intensity;                                                       // 0x23B8 (size: 0x8)
    double Fog Noise Max Samples;                                                     // 0x23C0 (size: 0x8)
    double Fog Noise Speed Scale;                                                     // 0x23C8 (size: 0x8)
    FVector Fog Noise Offset;                                                         // 0x23D0 (size: 0x18)
    double Mask Fog With Weather Masks;                                               // 0x23E8 (size: 0x8)
    double Extra Fog Extinction (Rainy);                                              // 0x23F0 (size: 0x8)
    double Extra Fog Extinction (Snowy);                                              // 0x23F8 (size: 0x8)
    double Extra Fog Extinction (Dusty);                                              // 0x2400 (size: 0x8)
    bool Render Ground Fog (Fog Above Distance Fields);                               // 0x2408 (size: 0x1)
    double Ground Fog Extinction (Foggy);                                             // 0x2410 (size: 0x8)
    double Ground Fog Extinction (Dusty);                                             // 0x2418 (size: 0x8)
    double Ground Fog Extinction (Rainy);                                             // 0x2420 (size: 0x8)
    double Ground Fog Extinction (Snowy);                                             // 0x2428 (size: 0x8)
    double Ground Fog Extinction (Manual);                                            // 0x2430 (size: 0x8)
    double Ground Fog Height;                                                         // 0x2438 (size: 0x8)
    double Ground Fog Height Noise;                                                   // 0x2440 (size: 0x8)
    double Ground Fog Angle Threshold;                                                // 0x2448 (size: 0x8)
    double Ground Fog Hardness;                                                       // 0x2450 (size: 0x8)
    bool Apply Water Fog Values;                                                      // 0x2458 (size: 0x1)
    double Water Extinction;                                                          // 0x2460 (size: 0x8)
    FLinearColor Water Albedo;                                                        // 0x2468 (size: 0x10)
    bool Volumetric Clouds Apply Fog Late;                                            // 0x2478 (size: 0x1)
    TSoftObjectPtr<UMaterialInterface> Global Volumetric Fog Parent Material;         // 0x2480 (size: 0x28)
    class UMaterialInstanceDynamic* Global Volumetric Fog MID;                        // 0x24A8 (size: 0x8)
    TSoftObjectPtr<UMaterialInterface> Global Volumetric Fog (Ground Fog ) Parent Material; // 0x24B0 (size: 0x28)
    FVector Fog Position;                                                             // 0x24D8 (size: 0x18)
    class UCurveLinearColor* Sun Disk Color Curve;                                    // 0x24F0 (size: 0x8)
    FVector Sun Target;                                                               // 0x24F8 (size: 0x18)
    FVector Moon Target;                                                              // 0x2510 (size: 0x18)
    TSoftObjectPtr<UTexture2D> Static Clouds Texture;                                 // 0x2528 (size: 0x28)
    double Static Clouds Rotation;                                                    // 0x2550 (size: 0x8)
    double Static Clouds Rotation Speed;                                              // 0x2558 (size: 0x8)
    float Static Clouds Color Intensity;                                              // 0x2560 (size: 0x4)
    double Clouds Time Based Movement Offset;                                         // 0x2568 (size: 0x8)
    double Cloud Movement Update Period;                                              // 0x2570 (size: 0x8)
    FTimerHandle Cloud Movement Cache Timer;                                          // 0x2578 (size: 0x8)
    double Clouds B Time Old;                                                         // 0x2580 (size: 0x8)
    FLinearColor Clouds Position Color A;                                             // 0x2588 (size: 0x10)
    FLinearColor Clouds Position Color B;                                             // 0x2598 (size: 0x10)
    FLinearColor Fog Position Color A;                                                // 0x25A8 (size: 0x10)
    FLinearColor Fog Position Color B;                                                // 0x25B8 (size: 0x10)
    double Clouds Time Elapsed Last Update;                                           // 0x25C8 (size: 0x8)
    int32 Next Cache Step;                                                            // 0x25D0 (size: 0x4)
    TArray<bool> Cache Group Booleans;                                                // 0x25D8 (size: 0x10)
    double Current Cache Timer Speed;                                                 // 0x25E8 (size: 0x8)
    int32 Low Priority Update Step;                                                   // 0x25F0 (size: 0x4)
    int32 Active Update Speed;                                                        // 0x25F4 (size: 0x4)
    int32 High Priority Update Step;                                                  // 0x25F8 (size: 0x4)
    int32 Non Cached Update Step;                                                     // 0x25FC (size: 0x4)
    double Max Property Cache Period - Time Of Day Transition;                        // 0x2600 (size: 0x8)
    bool Fast Cache Toggle;                                                           // 0x2608 (size: 0x1)
    int32 Minimum Active Update Speed;                                                // 0x260C (size: 0x4)
    double Fast Cache Toggle Speed;                                                   // 0x2610 (size: 0x8)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Moon;                 // 0x2618 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Fog;                  // 0x2628 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Sky Material;         // 0x2638 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Sky Atmosphere;       // 0x2648 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Simplified Color;     // 0x2658 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Sky Light;            // 0x2668 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Sun;                  // 0x2678 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group Volumetric Clouds;    // 0x2688 (size: 0x10)
    TArray<TEnumAsByte<UDS_CachedProperties::Type>> Cache Group 2D Clouds;            // 0x2698 (size: 0x10)
    double Wind Speed Multiplier;                                                     // 0x26A8 (size: 0x8)
    double Fog Vertical Velocity;                                                     // 0x26B0 (size: 0x8)
    double Volumetric Aurora Fade Distance (Km);                                      // 0x26B8 (size: 0x8)
    double Cinematic Clouds View Sample Scale;                                        // 0x26C0 (size: 0x8)
    double Cinematic Clouds Shadow Sample Scale;                                      // 0x26C8 (size: 0x8)
    double Cinematic Clouds Tracing Max Distance;                                     // 0x26D0 (size: 0x8)
    int32 Cinematic Clouds View Ray Sample Max Count;                                 // 0x26D8 (size: 0x4)
    TArray<class UUDS_Modifier_C*> Current Modifiers;                                 // 0x26E0 (size: 0x10)
    TArray<double> Modifier Alphas;                                                   // 0x26F0 (size: 0x10)
    TArray<double> Modifier Targets;                                                  // 0x2700 (size: 0x10)
    TArray<double> Modifier Speeds;                                                   // 0x2710 (size: 0x10)
    TArray<class UUDS_Modifier_C*> Starting Modifiers;                                // 0x2720 (size: 0x10)
    bool Preview Starting Modifiers In Editor;                                        // 0x2730 (size: 0x1)
    bool Replicate Modifiers To Clients;                                              // 0x2731 (size: 0x1)
    bool Using Volumetric Light Rays;                                                 // 0x2732 (size: 0x1)
    int32 Last Material Quality Level;                                                // 0x2734 (size: 0x4)
    int32 Last Effects Quality Level;                                                 // 0x2738 (size: 0x4)
    bool Instant Exposure Adjustment On Begin Play;                                   // 0x273C (size: 0x1)
    class UPostProcessComponent* Instant Exposure Post Process;                       // 0x2740 (size: 0x8)
    class UObject* Editor Tick Handler;                                               // 0x2748 (size: 0x8)
    double Tick Delta Seconds;                                                        // 0x2750 (size: 0x8)
    FVector Editor Camera Position;                                                   // 0x2758 (size: 0x18)
    FVector Editor Camera Position Offset;                                            // 0x2770 (size: 0x18)
    double Last Editor Tick Time;                                                     // 0x2788 (size: 0x8)
    TEnumAsByte<UDS_RunContext::Type> Run Context;                                    // 0x2790 (size: 0x1)
    double Slow Falling Combined Change Speed;                                        // 0x2798 (size: 0x8)
    double Combined Change Speed;                                                     // 0x27A0 (size: 0x8)
    class UStaticMesh* Custom Sky Sphere Static Mesh;                                 // 0x27A8 (size: 0x8)
    double Fallback Cloud Layer Altitude;                                             // 0x27B0 (size: 0x8)
    bool Level Editor Tick;                                                           // 0x27B8 (size: 0x1)
    double Time Of Last Cloud Cache;                                                  // 0x27C0 (size: 0x8)
    class UUDS_OcclusionState_C* Occlusion State;                                     // 0x27C8 (size: 0x8)
    double Last Static Clouds Update Time;                                            // 0x27D0 (size: 0x8)
    double Static Clouds Dynamic Rotation;                                            // 0x27D8 (size: 0x8)
    FRotator Editor Camera Rotation;                                                  // 0x27E0 (size: 0x18)
    double Cached Cloud Shadows Cancel Value;                                         // 0x27F8 (size: 0x8)
    double Interior Occlusion Change Speed;                                           // 0x2800 (size: 0x8)
    double Time of Last Cache Timing Update;                                          // 0x2808 (size: 0x8)
    double Old Interior Occlusion;                                                    // 0x2810 (size: 0x8)
    bool Transitioning Sky Light Intensity;                                           // 0x2818 (size: 0x1)
    bool Cache Sun Cast Shadows;                                                      // 0x2819 (size: 0x1)
    double Eclipse Percent;                                                           // 0x2820 (size: 0x8)
    double Sun Shadows Cutoff Z;                                                      // 0x2828 (size: 0x8)
    FUltra_Dynamic_Sky_CCurrent Hour Changed Current Hour Changed;                    // 0x2830 (size: 0x10)
    void Current Hour Changed(int32 Hour);
    FUltra_Dynamic_Sky_CEvery Minute Every Minute;                                    // 0x2840 (size: 0x10)
    void Every Minute(int32 Minute (0-59));
    bool Called Starting Event Dispatchers;                                           // 0x2850 (size: 0x1)
    FVector World Origin Location;                                                    // 0x2858 (size: 0x18)
    TSoftClassPtr<UObject> Editor Tick Handler Class;                                 // 0x2870 (size: 0x28)
    TSoftClassPtr<UObject> Editor Utility Opener Class;                               // 0x2898 (size: 0x28)
    FUDS_DateAndTime Event Date;                                                      // 0x28C0 (size: 0x18)
    FUltra_Dynamic_Sky_CDate Changed Date Changed;                                    // 0x28D8 (size: 0x10)
    void Date Changed();
    bool Initial Replication;                                                         // 0x28E8 (size: 0x1)
    FUDS_DateAndTime Starting Date;                                                   // 0x28F0 (size: 0x18)
    TArray<double> Unmodified Floats;                                                 // 0x2908 (size: 0x10)
    TArray<FLinearColor> Unmodified Colors;                                           // 0x2918 (size: 0x10)
    bool Modifiers Ticking;                                                           // 0x2928 (size: 0x1)
    TArray<TEnumAsByte<UDS_Modifier_Float_Property::Type>> Modified Float Properties; // 0x2930 (size: 0x10)
    TArray<TEnumAsByte<UDS_Modifier_Color_Property::Type>> Modified Color Properties; // 0x2940 (size: 0x10)
    bool Move Sky Light Location;                                                     // 0x2950 (size: 0x1)
    double Weather Cloud Coverage;                                                    // 0x2958 (size: 0x8)
    double Weather Fog;                                                               // 0x2960 (size: 0x8)
    double Weather Dust Amount;                                                       // 0x2968 (size: 0x8)
    FLinearColor Sky Glow Fog Color;                                                  // 0x2970 (size: 0x10)
    FLinearColor Cached Night Sky Glow;                                               // 0x2980 (size: 0x10)
    FLinearColor Cached Light Pollution;                                              // 0x2990 (size: 0x10)
    double Local Cloud Coverage;                                                      // 0x29A0 (size: 0x8)
    class UMaterialInstanceDynamic* Storm Clouds Draw MID;                            // 0x29A8 (size: 0x8)
    bool Cloud Painting Present;                                                      // 0x29B0 (size: 0x1)
    bool Radial Storm Clouds Present;                                                 // 0x29B1 (size: 0x1)
    TArray<FRadialStorm_CoverageBrush> Radial Storm Cloud Coverage Cache;             // 0x29B8 (size: 0x10)
    TMap<FString, double> Cvar Cache;                                                 // 0x29C8 (size: 0x50)
    class AUDS_Cloud_Paint_Container_C* Cloud Paint Container;                        // 0x2A18 (size: 0x8)
    TArray<class AActor*> Radial Storms;                                              // 0x2A20 (size: 0x10)
    FRotator Sun World Rotation;                                                      // 0x2A30 (size: 0x18)
    FRotator Moon World Rotation;                                                     // 0x2A48 (size: 0x18)
    class USkyLightComponent* Path Tracer Sky Light;                                  // 0x2A60 (size: 0x8)
    class UStaticMeshComponent* Global Volumetric Fog Mesh;                           // 0x2A68 (size: 0x8)
    class UUDS_PlayerOcclusion_C* Player Occlusion;                                   // 0x2A70 (size: 0x8)
    class UStaticMeshComponent* 2D Turbulence Disk;                                   // 0x2A78 (size: 0x8)
    class UNiagaraComponent* Volumetric Cloud Light Rays;                             // 0x2A80 (size: 0x8)
    class UStaticMeshComponent* Inside Cloud Fog Mesh;                                // 0x2A88 (size: 0x8)
    double Volumetric Cloud Shadow Altitude;                                          // 0x2A90 (size: 0x8)
    TArray<bool> Post Process Mats Toggle State;                                      // 0x2A98 (size: 0x10)
    FWeightedBlendable Lens Flare WB;                                                 // 0x2AA8 (size: 0x10)
    FWeightedBlendable Cloud Fog PP WB;                                               // 0x2AB8 (size: 0x10)
    class UPostProcessComponent* Static PPM Component;                                // 0x2AC8 (size: 0x8)
    TSoftObjectPtr<UMaterialInterface> Path Tracer Fog Parent Mat;                    // 0x2AD0 (size: 0x28)
    class UMaterialInstanceDynamic* Path Tracer Fog MID;                              // 0x2AF8 (size: 0x8)
    FWeightedBlendable Path Tracer Fog WB;                                            // 0x2B00 (size: 0x10)
    bool Render Height Fog In Path Tracer Using Post Process;                         // 0x2B10 (size: 0x1)
    class UTexture* Cloud Profile LUT Preview;                                        // 0x2B18 (size: 0x8)
    bool Previewing Cloud Profile Editor;                                             // 0x2B20 (size: 0x1)
    bool Alternate Tick;                                                              // 0x2B21 (size: 0x1)
    class UCurveFloat* Sky Atmosphere Density Curve;                                  // 0x2B28 (size: 0x8)
    bool Allow Disabling Directional Shadows with Coverage;                           // 0x2B30 (size: 0x1)
    bool Apply Flat Cloudiness;                                                       // 0x2B31 (size: 0x1)
    bool Using Sky Atmosphere;                                                        // 0x2B32 (size: 0x1)
    double Cached Moon Effective Illumination 0-1;                                    // 0x2B38 (size: 0x8)
    double Cached Absent Directional Lights Brightness;                               // 0x2B40 (size: 0x8)
    double Cached Current Moon Lit Percent;                                           // 0x2B48 (size: 0x8)
    bool Using Space Mode;                                                            // 0x2B50 (size: 0x1)
    bool Using Volumetric Clouds;                                                     // 0x2B51 (size: 0x1)
    bool Using Static Clouds;                                                         // 0x2B52 (size: 0x1)
    bool Using 2D Dynamic Clouds;                                                     // 0x2B53 (size: 0x1)
    bool Using Volumetric Aurora;                                                     // 0x2B54 (size: 0x1)
    double Cached Lit Intensity;                                                      // 0x2B58 (size: 0x8)
    double Cached Directional Light Dimming;                                          // 0x2B60 (size: 0x8)
    bool Modifiers Animating;                                                         // 0x2B68 (size: 0x1)
    double Cached Directional Inscattering Multiplier;                                // 0x2B70 (size: 0x8)
    TSoftObjectPtr<UMaterialInterface> Space Nebula Parent Material;                  // 0x2B78 (size: 0x28)
    FLinearColor Cached Fog Directional Inscattering;                                 // 0x2BA0 (size: 0x10)
    double Sun Moon Delta;                                                            // 0x2BB0 (size: 0x8)
    TEnumAsByte<ECollisionChannel> Weather Particle Collision Channel;                // 0x2BB8 (size: 0x1)
    bool Use Legacy Cloud Coverage Range;                                             // 0x2BB9 (size: 0x1)
    TArray<int32> Cache Group Countdowns;                                             // 0x2BC0 (size: 0x10)
    class UStaticMeshComponent* Space Nebula Sphere;                                  // 0x2BD0 (size: 0x8)
    TMap<UUDS_Modifier_C*, double> Preview Weather Modifiers;                         // 0x2BD8 (size: 0x50)
    double Movement Update Threshold;                                                 // 0x2C28 (size: 0x8)
    bool Show UDS Level Editor Toolbar;                                               // 0x2C30 (size: 0x1)
    FUltra_Dynamic_Sky_CCustom Time Custom Time;                                      // 0x2C38 (size: 0x10)
    void Custom Time(int32 Array Index);
    float Dedicated Server Tick Interval;                                             // 0x2C48 (size: 0x4)
    TArray<int32> Custom Time Dispatcher Flags;                                       // 0x2C50 (size: 0x10)
    bool Compensate Directional Inscattering;                                         // 0x2C60 (size: 0x1)
    bool Show Editor Warnings For Incompatible Project Settings;                      // 0x2C61 (size: 0x1)
    FUltra_Dynamic_Sky_CInstant Time of Day Change Instant Time of Day Change;        // 0x2C68 (size: 0x10)
    void Instant Time of Day Change();
    bool Light Functions Supported;                                                   // 0x2C78 (size: 0x1)
    bool DBuffer Supported;                                                           // 0x2C79 (size: 0x1)
    TSoftObjectPtr<UTexture2D> Static Overcast Texture;                               // 0x2C80 (size: 0x28)
    double Static Overcast Strength;                                                  // 0x2CA8 (size: 0x8)
    bool Caching Incoming Modifiers;                                                  // 0x2CB0 (size: 0x1)
    TMap<UUDS_Modifier_C*, double> Incoming Modifier Cache;                           // 0x2CB8 (size: 0x50)
    TSoftObjectPtr<UVolumeTexture> Simplified Color Sun Atmosphere LUT;               // 0x2D08 (size: 0x28)
    TSoftObjectPtr<UVolumeTexture> Simplified Color Moon Atmosphere LUT;              // 0x2D30 (size: 0x28)
    bool Static Clouds Fade In Clear Skies;                                           // 0x2D58 (size: 0x1)

    void Ground UDS Actor();
    void Update Replicated Modifiers();
    void Hide Sky(bool Hide Entire Actor, bool Hide Lights, bool Hide Fog/Atmosphere, bool Hide Sky Sphere/Clouds, bool Hide Post Processing);
    void Cache Global Fog Material Properties();
    void Set Apply Exposure Settings(bool Enabled);
    void Editor Return from PIE();
    void Simplified Cloud Dark Color(FLinearColor& Out);
    void Simplified Base Sky Color(FLinearColor& Out);
    void Apply Cached Incoming Modifiers();
    bool If DBuffer Supported();
    void Log UDS Version Number();
    void Dedicated Server Startup();
    void UDS Date Equal(FUDS_DateAndTime Date A, FUDS_DateAndTime Date B, bool& Equal);
    void Get Current UDS Date and Time(FUDS_DateAndTime& UDS Date and Time);
    void Editor Instant Update Active Properties();
